# SSH ржХржиржлрж┐ржЧрж╛рж░
Cisco switch-ржП SSH ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рж╛рж░ ржЬржирзНржп ржирж┐ржЪрзЗрж░ рж╕рзНржЯрзЗржкржЧрзБрж▓рзЛ ржЕржирзБрж╕рж░ржг ржХрж░рзБржи:

### рзз. **рж╣рзЛрж╕рзНржЯржирзЗржо ржПржмржВ ржбрзЛржорзЗржЗржи ржирж╛ржо рж╕рзЗржЯ ржХрж░рзБржи:**
SSH ржмрзНржпржмрж╣рж╛рж░рзЗрж░ ржЬржирзНржп рж╕рзБржЗржЪрзЗрж░ рж╣рзЛрж╕рзНржЯржирзЗржо ржПржмржВ ржбрзЛржорзЗржЗржи ржирж╛ржо ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рж╛ ржкрзНрж░ржпрж╝рзЛржЬржиред

```bash
Switch# configure terminal
Switch(config)# hostname YourSwitchName
Switch(config)# ip domain-name yourdomain.com
```

### рзи. **RSA ржХрзА ржЬрзЗржирж╛рж░рзЗржЯ ржХрж░рзБржи:**
SSH ржПржиржХрзНрж░рж┐ржкрж╢ржи ржмрзНржпржмрж╣рзГржд рж╣ржпрж╝, рждрж╛ржЗ ржирж┐рж░рж╛ржкржж ржпрзЛржЧрж╛ржпрзЛржЧрзЗрж░ ржЬржирзНржп RSA ржХрзА ржЬрзЗржирж╛рж░рзЗржЯ ржХрж░рждрзЗ рж╣ржмрзЗред

```bash
Switch(config)# crypto key generate rsa
```
ржЖржкржирж┐ ржпржЦржи ржХрзА рж╕рж╛ржЗржЬрзЗрж░ ржЬржирзНржп ржкрзНрж░ржорзНржкржЯ ржкрж╛ржмрзЗржи, рждржЦржи ржХржоржкржХрзНрж╖рзЗ рззрзжрзирзк ржмрж┐ржЯ ржирж┐рж░рзНржмрж╛ржЪржи ржХрж░рзБржи (рзирзжрзкрзо ржмрж┐ржЯ ржирж┐рж░рж╛ржкрждрзНрждрж╛рж░ ржЬржирзНржп ржнрж╛рж▓рзЛ)ред

```bash
The key modulus size is 2048
```

### рзй. **SSH рж╕ржВрж╕рзНржХрж░ржг рзи рж╕ржХрзНрж░рж┐ржпрж╝ ржХрж░рзБржи:**
Cisco рж╕рзБржЗржЪржЧрзБрж▓рж┐ SSH рж╕ржВрж╕рзНржХрж░ржг рзз ржПржмржВ рж╕ржВрж╕рзНржХрж░ржг рзи ржЙржнржпрж╝ржЗ рж╕рж╛ржкрзЛрж░рзНржЯ ржХрж░рзЗ, рждржмрзЗ рж╕ржВрж╕рзНржХрж░ржг рзи ржирж┐рж░рж╛ржкржжред SSH рж╕ржВрж╕рзНржХрж░ржг рзи рж╕ржХрзНрж░рж┐ржпрж╝ ржХрж░рждрзЗ ржирж┐ржЪрзЗрж░ ржХржорж╛ржирзНржб ржмрзНржпржмрж╣рж╛рж░ ржХрж░рзБржи:

```bash
Switch(config)# ip ssh version 2
```

### рзк. **ржПржХржЯрж┐ ржмрзНржпржмрж╣рж╛рж░ржХрж╛рж░рзАрж░ ржирж╛ржо ржПржмржВ ржкрж╛рж╕ржУржпрж╝рж╛рж░рзНржб рждрзИрж░рж┐ ржХрж░рзБржи:**
SSH рж▓ржЧржЗржи ржЕрзНржпрж╛ржХрзНрж╕рзЗрж╕рзЗрж░ ржЬржирзНржп ржПржХржЯрж┐ ржмрзНржпржмрж╣рж╛рж░ржХрж╛рж░рзАрж░ ржирж╛ржо ржПржмржВ ржкрж╛рж╕ржУржпрж╝рж╛рж░рзНржб рждрзИрж░рж┐ ржХрж░рждрзЗ рж╣ржмрзЗред

```bash
Switch(config)# username yourusername privilege 15 secret yourpassword
```
- `privilege 15` ржкрзБрж░рзЛ ржкрзНрж░рж╢рж╛рж╕ржирж┐ржХ ржЕрзНржпрж╛ржХрзНрж╕рзЗрж╕ ржжрзЗржпрж╝ред
- `yourusername` ржПржмржВ `yourpassword` ржкрж░рж┐ржмрж░рзНрждржи ржХрж░рзЗ ржЖржкржирж╛рж░ ржкржЫржирзНржжрж╕ржЗ ржмрзНржпржмрж╣рж╛рж░ржХрж╛рж░рзАрж░ ржирж╛ржо ржПржмржВ ржкрж╛рж╕ржУржпрж╝рж╛рж░рзНржб ржжрж┐ржиред

### рзл. **VTY рж▓рж╛ржЗржиржЧрзБрж▓рж┐ржХрзЗ SSH ржЕрзНржпрж╛ржХрзНрж╕рзЗрж╕рзЗрж░ ржЬржирзНржп рж╕ржХрзНрж╖ржо ржХрж░рзБржи:**
VTY рж▓рж╛ржЗржиржЧрзБрж▓рж┐рждрзЗ SSH ржЕрзНржпрж╛ржХрзНрж╕рзЗрж╕ рж╕ржХрзНрж╖ржо ржХрж░рждрзЗ рж╣ржмрзЗред

```bash
Switch(config)# line vty 0 15
Switch(config-line)# transport input ssh
Switch(config-line)# login local
```
ржПржЦрж╛ржирзЗ, `line vty 0 15` ржорж╛ржирзЗ рзж ржерзЗржХрзЗ рззрзл ржкрж░рзНржпржирзНржд рж╕ржХрж▓ VTY рж▓рж╛ржЗржи ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рж╛ рж╣ржмрзЗред

### рзм. **SSH ржПрж░ ржЬржирзНржп рж╕рзБржЗржЪ рж░рж┐ржмрзБржЯ ржХрж░рзБржи:**
рж╕ржм ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржи ржХрж░рж╛рж░ ржкрж░, SSH ржЕрзНржпрж╛ржХрзНрж╕рзЗрж╕ ржкрж░рзАржХрзНрж╖рж╛ ржХрж░рждрзЗ рж╕рзБржЗржЪ рж░рж┐ржмрзБржЯ ржХрж░рждрзЗ ржкрж╛рж░рзЗржи ржмрж╛ рж╢рзБржзрзБ SSH ржмрзНржпржмрж╣рж╛рж░ ржХрж░рзЗ рж╕рзБржЗржЪрзЗ рж▓ржЧржЗржи ржХрж░рж╛рж░ ржЪрзЗрж╖рзНржЯрж╛ ржХрж░рзБржиред

ржПржЦржи ржЖржкржирж┐ SSH ржжрж┐рзЯрзЗ рж╕рзБржЗржЪрзЗ рж▓ржЧржЗржи ржХрж░рждрзЗ ржкрж╛рж░ржмрзЗржиред SSH ржХрзНрж▓рж╛ржпрж╝рзЗржирзНржЯрзЗрж░ ржорж╛ржзрзНржпржорзЗ ржЖржкржирж╛рж░ рж╕рзБржЗржЪрзЗрж░ IP ржмрзНржпржмрж╣рж╛рж░ ржХрж░рзЗ рж▓ржЧржЗржи ржХрж░рзБржи:

```bash
ssh yourusername@Switch_IP_address
```

 ### ржЙржжрж╛рж╣рж░ржг

```bash
Switch>enable
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Switch(config)#hostname ? [рж╣рзЛрж╕рзНржЯржирзЗржо]
  WORD  This system's network name
Switch(config)#hostname cisco
cisco(config)#
cisco(config)#ip domain?
domain  domain-lookup  domain-name  
cisco(config)#ip domain-n
cisco(config)#ip domain-name ? [ ржбрзЛржорзЗржЗржи ржирж╛ржо]
  WORD  Default domain name
cisco(config)#ip domain-name cisco.com?
WORD  
cisco(config)#ip domain-name cisco.com
cisco(config)#
cisco(config)#crypto ? [*RSA ржХрзА ржЬрзЗржирж╛рж░рзЗржЯ]
  key  Long term key operations
cisco(config)#crypto key ?
  generate  Generate new keys
  zeroize   Remove keys
cisco(config)#crypto key gene
cisco(config)#crypto key generate ?
  rsa  Generate RSA keys
cisco(config)#crypto key generate rs
cisco(config)#crypto key generate rsa ?
  general-keys  Generate a general purpose RSA key pair for signing and
                encryption
  <cr>
cisco(config)#crypto key generate rsa 
The name for the keys will be: cisco.cisco.com
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 512
% Generating 512 bit RSA keys, keys will be non-exportable...[OK]

cisco(config)#
cisco(config)# ip ?
*Mar 1 0:4:30.372: RSA key size needs to be at least 768 bits for ssh version 2
*Mar 1 0:4:30.372: %SSH-5-ENABLED: SSH 1.5 has been enabled
  access-list      Named access-list
  arp              IP ARP global configuration
  default-gateway  Specify default gateway (if not routing IP)
  dhcp             Configure DHCP server and relay parameters
  domain           IP DNS Resolver
  domain-lookup    Enable IP Domain Name System hostname translation
  domain-name      Define the default domain name
  ftp              FTP configuration commands
  host             Add an entry to the ip hostname table
  name-server      Specify address of name server to use
  scp              Scp commands
  ssh              Configure ssh options
cisco(config)# ip ssh ?  [SSH ]
  authentication-retries  Specify number of authentication retries
  time-out                Specify SSH time-out interval
  version                 Specify protocol version to be supported
cisco(config)# ip ssh ver
cisco(config)# ip ssh version ?
  <1-2>  Protocol version
cisco(config)# ip ssh version 2
Please create RSA keys (of at least 768 bits size) to enable SSH v2.
cisco(config)#username ?  [username & Password]
  WORD  User name
cisco(config)#username cisco?
WORD  
cisco(config)#username cisco ?
  password   Specify the password for the user
  privilege  Set user privilege level
  secret     Specify the secret for the user
  <cr>
cisco(config)#username cisco se
cisco(config)#username cisco secret ? 
  0     Specifies an UNENCRYPTED secret will follow
  5     Specifies a HIDDEN secret will follow
  LINE  The UNENCRYPTED (cleartext) user secret
cisco(config)#username cisco secret cisco
cisco(config)#
cisco(config)#do show run
Building configuration...

Current configuration : 1178 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname cisco
!
!
!
ip ssh version 1
ip domain-name cisco.com
!
username cisco secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0   [username & passsowrd]
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
 --More-- 
cisco(config)#do show ip interface brief 
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual up                    up 
FastEthernet0/2        unassigned      YES manual down                  down 
FastEthernet0/3        unassigned      YES manual down                  down 
FastEthernet0/4        unassigned      YES manual down                  down 
FastEthernet0/5        unassigned      YES manual down                  down 
FastEthernet0/6        unassigned      YES manual down                  down 
FastEthernet0/7        unassigned      YES manual down                  down 
FastEthernet0/8        unassigned      YES manual down                  down 
FastEthernet0/9        unassigned      YES manual down                  down 
FastEthernet0/10       unassigned      YES manual down                  down 
FastEthernet0/11       unassigned      YES manual down                  down 
FastEthernet0/12       unassigned      YES manual down                  down 
FastEthernet0/13       unassigned      YES manual down                  down 
FastEthernet0/14       unassigned      YES manual down                  down 
FastEthernet0/15       unassigned      YES manual down                  down 
FastEthernet0/16       unassigned      YES manual down                  down 
FastEthernet0/17       unassigned      YES manual down                  down 
FastEthernet0/18       unassigned      YES manual down                  down 
FastEthernet0/19       unassigned      YES manual down                  down 
FastEthernet0/20       unassigned      YES manual down                  down 
FastEthernet0/21       unassigned      YES manual down                  down 
FastEthernet0/22       unassigned      YES manual down                  down 
FastEthernet0/23       unassigned      YES manual down                  down 
FastEthernet0/24       unassigned      YES manual down                  down 
GigabitEthernet0/1     unassigned      YES manual down                  down 
GigabitEthernet0/2     unassigned      YES manual down                  down 
Vlan1                  unassigned      YES manual administratively down down

cisco(config)#interface
cisco(config)#interface vlan 1
cisco(config-if)#no shutdown

cisco(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up

cisco(config-if)#do show ip interface brief 
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual up                    up 
FastEthernet0/2        unassigned      YES manual down                  down 
FastEthernet0/3        unassigned      YES manual down                  down 
FastEthernet0/4        unassigned      YES manual down                  down 
FastEthernet0/5        unassigned      YES manual down                  down 
FastEthernet0/6        unassigned      YES manual down                  down 
FastEthernet0/7        unassigned      YES manual down                  down 
FastEthernet0/8        unassigned      YES manual down                  down 
FastEthernet0/9        unassigned      YES manual down                  down 
FastEthernet0/10       unassigned      YES manual down                  down 
FastEthernet0/11       unassigned      YES manual down                  down 
FastEthernet0/12       unassigned      YES manual down                  down 
FastEthernet0/13       unassigned      YES manual down                  down 
FastEthernet0/14       unassigned      YES manual down                  down 
FastEthernet0/15       unassigned      YES manual down                  down 
FastEthernet0/16       unassigned      YES manual down                  down 
FastEthernet0/17       unassigned      YES manual down                  down 
FastEthernet0/18       unassigned      YES manual down                  down 
FastEthernet0/19       unassigned      YES manual down                  down 
FastEthernet0/20       unassigned      YES manual down                  down 
FastEthernet0/21       unassigned      YES manual down                  down 
FastEthernet0/22       unassigned      YES manual down                  down 
FastEthernet0/23       unassigned      YES manual down                  down 
FastEthernet0/24       unassigned      YES manual down                  down 
GigabitEthernet0/1     unassigned      YES manual down                  down 
GigabitEthernet0/2     unassigned      YES manual down                  down 
Vlan1                  unassigned      YES manual up                    up

cisco(config-if)#ip address 192.168.0.2 255.255.255.0
cisco(config-if)#do show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual up                    up 
FastEthernet0/2        unassigned      YES manual down                  down 
FastEthernet0/3        unassigned      YES manual down                  down 
FastEthernet0/4        unassigned      YES manual down                  down 
FastEthernet0/5        unassigned      YES manual down                  down 
FastEthernet0/6        unassigned      YES manual down                  down 
FastEthernet0/7        unassigned      YES manual down                  down 
FastEthernet0/8        unassigned      YES manual down                  down 
FastEthernet0/9        unassigned      YES manual down                  down 
FastEthernet0/10       unassigned      YES manual down                  down 
FastEthernet0/11       unassigned      YES manual down                  down 
FastEthernet0/12       unassigned      YES manual down                  down 
FastEthernet0/13       unassigned      YES manual down                  down 
FastEthernet0/14       unassigned      YES manual down                  down 
FastEthernet0/15       unassigned      YES manual down                  down 
FastEthernet0/16       unassigned      YES manual down                  down 
FastEthernet0/17       unassigned      YES manual down                  down 
FastEthernet0/18       unassigned      YES manual down                  down 
FastEthernet0/19       unassigned      YES manual down                  down 
FastEthernet0/20       unassigned      YES manual down                  down 
FastEthernet0/21       unassigned      YES manual down                  down 
FastEthernet0/22       unassigned      YES manual down                  down 
FastEthernet0/23       unassigned      YES manual down                  down 
FastEthernet0/24       unassigned      YES manual down                  down 
GigabitEthernet0/1     unassigned      YES manual down                  down 
GigabitEthernet0/2     unassigned      YES manual down                  down 
Vlan1                  192.168.0.2     YES manual up                    up
cisco(config)#ip default-gateway 192.168.0.1
cisco(config)#line vty 0 15
cisco(config-line)#password ?
  7     Specifies a HIDDEN password will follow
  LINE  The UNENCRYPTED (cleartext) line password
cisco(config-line)#password cisco
cisco(config-line)#login
cisco(config-line)#exit
cisco(config-line)#password ?
  7     Specifies a HIDDEN password will follow
  LINE  The UNENCRYPTED (cleartext) line password
cisco(config-line)#password cisco
cisco(config-line)#login
cisco(config-line)#exit
cisco(config)#enable secret cisco
cisco(config)#service passw
cisco(config)#service password-encryption 
cisco(config)#do show run 
Building configuration...

Current configuration : 1320 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
!
hostname cisco
!
enable secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0
!
!
!
ip ssh version 1
ip domain-name cisco.com
!
username cisco secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
!
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
!
interface FastEthernet0/16
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
!
interface GigabitEthernet0/2
!
interface Vlan1
 ip address 192.168.0.2 255.255.255.0
!
ip default-gateway 192.168.0.1
!
!
!
!
line con 0
!
line vty 0 4
 password 7 0822455D0A16
 login
line vty 5 15
 password 7 0822455D0A16
 login
!
!
!
!
end

cisco(config)#line vty 0 15  [ssh/telnet allow]
cisco(config-line)#trans
cisco(config-line)#tra
cisco(config-line)#transport ?
  input   Define which protocols to use when connecting to the terminal server
  output  Define which protocols to use for outgoing connections
cisco(config-line)#transport inpu
cisco(config-line)#transport input ?
  all     All protocols
  none    No protocols
  ssh     TCP/IP SSH protocol
  telnet  TCP/IP Telnet protocol
cisco(config-line)# transport input all 
cisco(config-line)# do show run
Building configuration...

Current configuration : 1320 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
!
hostname cisco
!
enable secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0
!
!
!
ip ssh version 1
ip domain-name cisco.com
!
username cisco secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
!
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
!
interface FastEthernet0/16
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
!
interface GigabitEthernet0/2
!
interface Vlan1
 ip address 192.168.0.2 255.255.255.0
!
ip default-gateway 192.168.0.1
!
!
!
!
line con 0
!
line vty 0 4
 password 7 0822455D0A16
 login
line vty 5 15
 password 7 0822455D0A16
 login
!
!
!
!
end
```

ржПржЗ ржЫрж┐рж▓рзЛ SSH ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржи ржкрзНрж░ржХрзНрж░рж┐ржпрж╝рж╛!
# ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐
рж╕рж┐рж╕рзНржХрзЛ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рж╛рж░ ржЬржирзНржп ржирж┐ржорзНржирж▓рж┐ржЦрж┐ржд рж╕рзНржЯрзЗржкржЧрзБрж▓рж┐ ржЕржирзБрж╕рж░ржг ржХрж░рждрзЗ ржкрж╛рж░рзЗржи:

### 1. ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ рж╕ржХрзНрж░рж┐рзЯ ржХрж░рж╛
ржкрзНрж░ржержорзЗ, ржЖржкржирж╛ржХрзЗ ржкрзЛрж░рзНржЯржЯрж┐ рж╕рж┐рж▓рзЗржХрзНржЯ ржХрж░рждрзЗ рж╣ржмрзЗ ржпрзЗржЯрж┐ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рждрзЗ ржЪрж╛ржиред ржПрж░ржкрж░, ржЖржкржирж┐ рж╕рзЗржЗ ржкрзЛрж░рзНржЯрзЗ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржЕрзНржпрж╛ржХрзНржЯрж┐ржнрзЗржЯ ржХрж░ржмрзЗржиред ржЙржжрж╛рж╣рж░ржгрж╕рзНржмрж░рзВржк, ржпржжрж┐ ржЖржкржирж┐ ржЗржерж╛рж░ржирзЗржЯ ржкрзЛрж░рзНржЯ 0/1 ржмрзНржпржмрж╣рж╛рж░ ржХрж░рзЗржи, рждрж╛рж╣рж▓рзЗ:

```bash
Switch(config)# interface fastEthernet 0/1
Switch(config-if)# switchport port-security
```
### Violation Shutdown
**Port Security Violation Shutdown** рж╣рж▓ ржПржХржЯрж┐ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржЕрзНржпрж╛ржХрж╢ржи ржпрж╛ рждржЦржи ржХрж╛рж░рзНржпржХрж░ рж╣рзЯ ржпржЦржи ржкрзЛрж░рзНржЯрзЗ ржХрзЛржирзЛ **ржЕржиржирзБржорзЛржжрж┐ржд** MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ рж╕ржВржпрзБржХрзНржд рж╣рзЯ, ржЕржержмрж╛ ржпржжрж┐ ржкрзЛрж░рзНржЯрзЗ ржмрзНржпржмрж╣рзГржд MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕рзЗрж░ рж╕ржВржЦрзНржпрж╛ рж╕рзАржорж╛рж░ ржмрж╛ржЗрж░рзЗ ржЪрж▓рзЗ ржпрж╛рзЯред ржПржЗ ржЕржмрж╕рзНржерж╛рзЯ, ржкрзЛрж░рзНржЯржЯрж┐ **ржЕржЯрзЛржорзЗржЯрж┐ржХрзНржпрж╛рж▓рж┐ ржмржирзНржз (shutdown)** рж╣рзЯрзЗ ржпрж╛рзЯ ржПржмржВ рж╕рзЗржЗ ржкрзЛрж░рзНржЯрзЗ ржЖрж░ ржХрзЛржирзЛ ржЯрзНрж░рзНржпрж╛ржлрж┐ржХ ржкрж╛рж╕ ржХрж░рждрзЗ ржкрж╛рж░рзЗ ржирж╛ ржпрждржХрзНрж╖ржг ржирж╛ ржорзНржпрж╛ржирзБрзЯрж╛рж▓рж┐ ржкрзБржирж░рж╛рзЯ ржкрзЛрж░рзНржЯржЯрж┐ ржЪрж╛рж▓рзБ ржХрж░рж╛ рж╣рзЯред

### Violation Shutdown ржПрж░ ржХрж╛рж░рзНржпржкрзНрж░ржгрж╛рж▓рзА:
1. **ржЕржиржирзБржорзЛржжрж┐ржд MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ рж╕ржВржпрзБржХрзНржд рж╣рж▓рзЗ**: ржпржжрж┐ ржХрзЛржирзЛ ржбрж┐ржнрж╛ржЗрж╕рзЗрж░ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржирзЗрж░ рж╕рж╛ржерзЗ ржорзЗрж▓рзЗржирж╛, рждржмрзЗ ржкрзЛрж░рзНржЯржЯрж┐ **shutdown** рж╣рзЯрзЗ ржпрж╛ржмрзЗред
2. **MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ рж╕рзАржорж╛ ржЕрждрж┐ржХрзНрж░ржо рж╣рж▓рзЗ**: ржпржжрж┐ ржкрзЛрж░рзНржЯрзЗ ржЕржирзБржорзЛржжрж┐ржд MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕рзЗрж░ рж╕ржВржЦрзНржпрж╛ рж╕рзАржорж╛ ржЫрж╛ржбрж╝рж┐рзЯрзЗ ржпрж╛рзЯ, рждржмрзЗ ржкрзЛрж░рзНржЯржЯрж┐ ржмржирзНржз рж╣рзЯрзЗ ржпрж╛ржмрзЗред
3. **ржкрзЛрж░рзНржЯ ржмржирзНржз рж╣ржУрзЯрж╛рж░ ржкрж░**: ржкрзЛрж░рзНржЯржЯрж┐ **err-disable (error-disabled)** рж╣рзЯрзЗ ржпрж╛ржмрзЗ, ржЕрж░рзНржерж╛рзО ржкрзЛрж░рзНржЯржЯрж┐ ржбрж╛ржЙржи рж╣рзЯрзЗ ржпрж╛ржмрзЗ ржПржмржВ ржирждрзБржи рж╕ржВржпрзЛржЧ ржЧрзНрж░рж╣ржг ржХрж░ржмрзЗ ржирж╛ред

### Violation Shutdown ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржи:
ржЖржкржирж┐ ржпржжрж┐ ржЪрж╛ржи ржпрзЗ, ржпржЦржи ржХрзЛржирзЛ violation (ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи) ржШржЯржмрзЗ рждржЦржи ржкрзЛрж░рзНржЯржЯрж┐ ржмржирзНржз рж╣рзЯрзЗ ржпрж╛ржмрзЗ, рждрж╛рж╣рж▓рзЗ ржирж┐ржорзНржирж▓рж┐ржЦрж┐ржд ржХржорж╛ржирзНржбржЯрж┐ ржмрзНржпржмрж╣рж╛рж░ ржХрж░ржмрзЗржи:

```bash
Switch(config)# interface fastEthernet 0/1
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security violation shutdown
```

### ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржи ржмрзНржпрж╛ржЦрзНржпрж╛:
- `switchport port-security`: ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ рж╕ржХрзНрж░рж┐рзЯ ржХрж░рзЗред
- `switchport port-security violation shutdown`: ржпржжрж┐ ржХрзЛржирзЛ violation ржШржЯрзЗ (ржпрзЗржоржи, ржХрзЛржирзЛ ржЕржиржирзБржорзЛржжрж┐ржд MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ рж╕ржВржпрзБржХрзНржд рж╣рж▓рзЗ), рждржЦржи ржкрзЛрж░рзНржЯржЯрж┐ **shutdown** рж╣рзЯрзЗ ржпрж╛ржмрзЗред

### ржкрзЛрж░рзНржЯржЯрж┐ ржкрзБржирж░рж╛рзЯ ржЪрж╛рж▓рзБ ржХрж░рж╛:
ржпржжрж┐ ржкрзЛрж░рзНржЯржЯрж┐ **shutdown** рж╣рзЯрзЗ ржпрж╛рзЯ, рждрж╛рж╣рж▓рзЗ ржЖржкржирж╛ржХрзЗ ржорзНржпрж╛ржирзБрзЯрж╛рж▓рж┐ ржкрзЛрж░рзНржЯржЯрж┐ ржкрзБржирж░рж╛рзЯ **up** ржХрж░рждрзЗ рж╣ржмрзЗред ржЖржкржирж┐ ржПржЯрж┐ `shutdown` ржПржмржВ `no shutdown` ржХржорж╛ржирзНржб ржжрж┐рзЯрзЗ ржХрж░рждрзЗ ржкрж╛рж░рзЗржи:

```bash
Switch(config-if)# shutdown
Switch(config-if)# no shutdown
```

### Violation Shutdown ржПрж░ рж╕рзБржмрж┐ржзрж╛:
- **рж╕рзБрж░ржХрзНрж╖рж╛**: ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи рж╣рж▓рзЗ ржкрзЛрж░рзНржЯржЯрж┐ ржмржирзНржз рж╣рзЯрзЗ ржпрж╛ржУрзЯрж╛рзЯ, ржЕржиржирзБржорзЛржжрж┐ржд ржбрж┐ржнрж╛ржЗрж╕ ржмрж╛ ржорж╛рж▓рж┐рж╕рж┐рзЯрж╛рж╕ ржбрж┐ржнрж╛ржЗрж╕ ржирзЗржЯржУрзЯрж╛рж░рзНржХрзЗ ржкрзНрж░ржмрзЗрж╢ ржХрж░рждрзЗ ржкрж╛рж░рзЗ ржирж╛ред
- **рж╕рзНржмрзЯржВржХрзНрж░рж┐рзЯ ржкрзНрж░рждрж┐ржХрзНрж░рж┐рзЯрж╛**: ржкрзЛрж░рзНржЯржЯрж┐ ржмржирзНржз рж╣рзЯрзЗ ржпрж╛ржУрзЯрж╛рзЯ ржЖржкржирж┐ ржжрзНрж░рзБржд рж╕ржорж╕рзНржпрж╛рж░ ржЪрж┐рж╣рзНржирж┐ржд ржХрж░рждрзЗ ржкрж╛рж░ржмрзЗржи ржПржмржВ ржбрж┐ржнрж╛ржЗрж╕ржЯрж┐рж░ рж╕рж╛ржерзЗ рж╕ржорзНржкрж░рзНржХрж┐ржд ржХрзЛржирзЛ рж╕ржорж╕рзНржпрж╛ рж╕ржорж╛ржзрж╛ржи ржХрж░рждрзЗ ржкрж╛рж░ржмрзЗржиред

### Violation Shutdown Troubleshooting:
ржпржжрж┐ ржкрзЛрж░рзНржЯржЯрж┐ **err-disable** рж╣рзЯрзЗ ржпрж╛рзЯ, рждрж╛рж╣рж▓рзЗ ржПржЯрж┐ ржЪрзЗржХ ржХрж░рждрзЗ ржкрж╛рж░рзЗржи:

```bash
Switch# show interface status err-disabled
```

ржПржмржВ ржкрзЛрж░рзНржЯржЯрж┐ ржкрзБржирж░рж╛рзЯ рж╕ржХрзНрж░рж┐рзЯ ржХрж░рждрзЗ:

```bash
Switch# show port-security interface fastEthernet 0/1
Switch# clear port-security sticky interface fastEthernet 0/1
```

ржПржнрж╛ржмрзЗ, **Violation Shutdown** ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐рж░ ржПржХржЯрж┐ ржЧрзБрж░рзБрждрзНржмржкрзВрж░рзНржг ржЕржВрж╢ ржпрж╛ ржирзЗржЯржУрзЯрж╛рж░рзНржХрзЗрж░ ржирж┐рж░рж╛ржкрждрзНрждрж╛ ржирж┐рж╢рзНржЪрж┐ржд ржХрж░рзЗред
### 2. ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐рж░ ржирж┐рзЯржо рж╕рзЗржЯ ржХрж░рж╛
ржЖржкржирж╛рж░ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐рж░ ржЬржирзНржп ржХрж┐ржЫрзБ ржкрзНржпрж╛рж░рж╛ржорж┐ржЯрж╛рж░ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рждрзЗ рж╣ржмрзЗ, ржпрзЗржоржи:

- **ржорзНржпрж╛ржХ ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ рж╕рзАржорж╛**: ржХрждржЯрж┐ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ ржкрзЛрж░рзНржЯрзЗ ржЕржирзБржорзЛржжрж┐ржд рж╣ржмрзЗ
- **ржЕрзНржпрж╛ржХрж╢ржи**: ржпржжрж┐ ржХрзЛржирзЛ ржирж┐рж╖рж┐ржжрзНржз ржбрж┐ржнрж╛ржЗрж╕ ржкрзЛрж░рзНржЯрзЗ рж╕ржВржпрзБржХрзНржд рж╣рзЯ рждрж╛рж╣рж▓рзЗ ржХрж┐ рж╣ржмрзЗ (рж╕рзЗржЯржЖржк ржХрж░рж╛ ржпрзЗрждрзЗ ржкрж╛рж░рзЗ "restrict", "protect", ржмрж╛ "shutdown" ржЕрзНржпрж╛ржХрж╢ржи)
- **MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ рж▓ржХ ржХрж░рж╛**: ржкрзЛрж░рзНржЯрзЗ ржорзНржпрж╛ржирзБрзЯрж╛рж▓рж┐ ржирж┐рж░рзНржжрж┐рж╖рзНржЯ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ рж╕рзЗржЯ ржХрж░рж╛ред
- **Port Security Sticky Mode** рж╕рж┐рж╕рзНржХрзЛ рж╕рзБржЗржЪрзЗ ржПржХржЯрж┐ ржлрж┐ржЪрж╛рж░ ржпрж╛ ржкрзЛрж░рзНржЯрзЗ рж╕ржВржпрзБржХрзНржд MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ржЧрзБрж▓рзЗрж╛ржХрзЗ **рж╕рзНржмрзЯржВржХрзНрж░рж┐рзЯржнрж╛ржмрзЗ рж╕рзБрж░ржХрзНрж╖рж┐ржд** ржХрж░рзЗ рж░рж╛ржЦрзЗред ржПржЗ ржорзЛржбрзЗ, ржпржЦржи ржПржХржЯрж┐ ржбрж┐ржнрж╛ржЗрж╕ ржкрзНрж░ржержоржмрж╛рж░рзЗрж░ ржорждрзЛ ржПржХржЯрж┐ ржкрзЛрж░рзНржЯрзЗ рж╕ржВржпрзБржХрзНржд рж╣рзЯ, рждржЦржи ржкрзЛрж░рзНржЯржЯрж┐ ржР ржбрж┐ржнрж╛ржЗрж╕рзЗрж░ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ржЯрж┐ржХрзЗ "sticky" рж╣рж┐рж╕рзЗржмрзЗ рж╕рзНржорж░ржг ржХрж░рзЗ рж░рж╛ржЦрзЗред ржПрж░ ржорж╛ржирзЗ рж╣рж▓рзЛ, рж╕рж┐рж╕рзНржХрзЛ рж╕рзБржЗржЪ ржР MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ржЯрж┐ржХрзЗ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐рж░ рждрж╛рж▓рж┐ржХрж╛рзЯ ржЕрж╕рзНржерж╛рзЯрзАржнрж╛ржмрзЗ ржпрзЛржЧ ржХрж░рзЗ ржПржмржВ ржнржмрж┐рж╖рзНржпрждрзЗ ржР MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ржЯрж┐ рж╢рзБржзрзБржорж╛рждрзНрж░ ржР ржкрзЛрж░рзНржЯрзЗ ржмрзНржпржмрж╣рзГржд рж╣рждрзЗ ржкрж╛рж░рзЗред

Sticky ржорзЛржбрзЗ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рж▓рзЗ, ржбрж┐ржнрж╛ржЗрж╕ржЯрж┐рж░ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ржЯрж┐ рж╕рзЗржЗ ржкрзЛрж░рзНржЯрзЗ рж╕рзНржЯрзЛрж░ рж╣рзЯрзЗ ржпрж╛рзЯ ржПржмржВ ржкрзБржирж░рж╛рзЯ рж╕рзБржЗржЪ рж░рж┐рж╕рзНржЯрж╛рж░рзНржЯ рж╣рж▓рзЗ, рж╕рж┐рж╕рзНржЯрзЗржо ржР MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ржЧрзБрж▓рзЗрж╛ ржЖржмрж╛рж░ржУ рж╕рзНржмрзЯржВржХрзНрж░рж┐рзЯржнрж╛ржмрзЗ ржкрзБржирж░рзБржжрзНржзрж╛рж░ ржХрж░рзЗ, ржПрж░ ржлрж▓рзЗ ржирждрзБржи ржХрж░рзЗ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ ржпрзБржХрзНржд ржХрж░рж╛рж░ ржкрзНрж░рзЯрзЛржЬржи рж╣рзЯ ржирж╛ред

#### Sticky Mode-ржПрж░ рж╕рзБржмрж┐ржзрж╛:
1. **рж╕рзНржмрзЯржВржХрзНрж░рж┐рзЯ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ рж╕ржВрж░ржХрзНрж╖ржг**: ржЖржкржирж┐ ржпржЦржи ржХрзЛржирзЛ ржбрж┐ржнрж╛ржЗрж╕ рж╕ржВржпрзБржХрзНржд ржХрж░рзЗржи, рждржЦржи ржР ржбрж┐ржнрж╛ржЗрж╕рзЗрж░ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ ржкрзЛрж░рзНржЯрзЗ рж╕рзНржмрзЯржВржХрзНрж░рж┐рзЯржнрж╛ржмрзЗ ржпрзБржХрзНржд рж╣рзЯрзЗ ржпрж╛рзЯред
2. **рж╕рзБрж░ржХрзНрж╖рж╛**: ржПржЯрж┐ ржкрзЛрж░рзНржЯрзЗ рж╢рзБржзрзБржорж╛рждрзНрж░ ржЕржирзБржорзЛржжрж┐ржд MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ржЧрзБрж▓рзЗрж╛ рж╕ржВржпрзБржХрзНржд ржерж╛ржХрждрзЗ ржирж┐рж╢рзНржЪрж┐ржд ржХрж░рзЗ, ржлрж▓рзЗ ржиржХрж▓ ржмрж╛ ржЕржиржирзБржорзЛржжрж┐ржд ржбрж┐ржнрж╛ржЗрж╕рзЗрж░ рж╕ржВржпрзЛржЧ ржмржирзНржз рж╣рзЯрзЗ ржпрж╛рзЯред
3. **ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржи рж╕рж╣ржЬ ржХрж░рж╛**: ржЖржкржирж┐ ржорзНржпрж╛ржирзБрзЯрж╛рж▓рж┐ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ ржХржиржлрж┐ржЧрж╛рж░ ржирж╛ ржХрж░рзЗ, рж╢рзБржзрзБржорж╛рждрзНрж░ Sticky ржорзЛржб ржмрзНржпржмрж╣рж╛рж░ ржХрж░рзЗ рж╕ржорж╕рзНржд MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рждрзЗ ржкрж╛рж░рзЗржиред

#### Sticky Mode-ржПрж░ ржХрж╛ржЬрзЗрж░ ржкржжрзНржзрждрж┐:
- ржпржЦржи ржПржХржЯрж┐ ржбрж┐ржнрж╛ржЗрж╕ ржкрзНрж░ржержоржмрж╛рж░ ржкрзЛрж░рзНржЯрзЗ рж╕ржВржпрзБржХрзНржд рж╣рзЯ, рждржЦржи ржР MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ржЯрж┐ рж╕рж┐рж╕рзНржХрзЛ рж╕рзБржЗржЪрзЗ `sticky` рж╣рж┐рж╕рзЗржмрзЗ рж╕ржВрж░ржХрзНрж╖рж┐ржд рж╣рзЯрзЗ ржпрж╛рзЯред
- ржР MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ржЯрж┐рж░ ржкрж░рзЗ ржпржжрж┐ ржкрзЛрж░рзНржЯрзЗ ржЖрж░рзЗржХржЯрж┐ ржбрж┐ржнрж╛ржЗрж╕ рж╕ржВржпрзБржХрзНржд ржХрж░рж╛ рж╣рзЯ ржпрж╛рж░ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ржЯрж┐ ржЖржЧрзЗ ржерзЗржХрзЗржЗ рж╕рзНржЯрзЛрж░ ржХрж░рж╛ ржерж╛ржХрзЗ, рждржмрзЗ ржР ржбрж┐ржнрж╛ржЗрж╕ржЯрж┐ ржкрзЛрж░рзНржЯрзЗ ржХрж╛ржЬ ржХрж░ржмрзЗред
- ржпржжрж┐ ржР MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ржЯрж┐рж░ рж╕рзАржорж╛ ржкрж╛рж░ рж╣рзЯрзЗ ржпрж╛рзЯ ржмрж╛ ржЕржирзНржп ржХрзЛржирзЛ ржЕржиржирзБржорзЛржжрж┐ржд MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ рж╕ржВржпрзБржХрзНржд рж╣рзЯ, рждржЦржи ржирж┐рж░рзНржжрж┐рж╖рзНржЯ ржЕрзНржпрж╛ржХрж╢ржи ржпрзЗржоржи `restrict`, `shutdown`, ржмрж╛ `protect` ржХрж╛рж░рзНржпржХрж░ рж╣рзЯред

#### Sticky Mode ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рж╛рж░ ржЙржжрж╛рж╣рж░ржг:
```bash
Switch(config)# interface fastEthernet 0/1
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security maximum 2
Switch(config-if)# switchport port-security violation restrict
```

ржПржнрж╛ржмрзЗ, **Sticky Mode** ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐рж░ ржорж╛ржзрзНржпржорзЗ ржЖржкржирж╛ржХрзЗ рж╕рзНржмрзЯржВржХрзНрж░рж┐рзЯржнрж╛ржмрзЗ рж╕рзБрж░ржХрзНрж╖рж┐ржд MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ ржмрзНржпржмрж╕рзНржерж╛ржкржирж╛ ржХрж░рждрзЗ рж╕рж╛рж╣рж╛ржпрзНржп ржХрж░рзЗред
#### ржЙржжрж╛рж╣рж░ржг:
1. ржкрзЛрж░рзНржЯрзЗ ржПржХржорж╛рждрзНрж░ ржПржХржЯрж┐ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ ржЕржирзБржорзЛржжрж┐ржд рж╣ржмрзЗ:
```bash
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation restrict
```

2. ржПржХржЯрж┐ ржирж┐рж░рзНржжрж┐рж╖рзНржЯ MAC ржЕрзНржпрж╛ржбрзНрж░рзЗрж╕ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рж╛:
```bash
Switch(config-if)# switchport port-security mac-address 0010.1234.5678
```

3. ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржирж┐рж╖рж┐ржжрзНржз ржХрж░рж╛рж░ ржЬржирзНржп:
```bash
Switch(config-if)# switchport port-security violation shutdown
```

#### 3. ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ рж╕рзНржЯрзНржпрж╛ржЯрж╛рж╕ ржЪрзЗржХ ржХрж░рж╛
ржЖржкржирж┐ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐рж░ ржмрж░рзНрждржорж╛ржи рж╕рзНржЯрзНржпрж╛ржЯрж╛рж╕ ржжрзЗржЦрждрзЗ ржЪрж╛ржЗрж▓рзЗ ржирж┐ржЪрзЗрж░ ржХржорж╛ржирзНржб ржмрзНржпржмрж╣рж╛рж░ ржХрж░рждрзЗ ржкрж╛рж░рзЗржи:

```bash
Switch# show port-security interface fastEthernet 0/1
```

#### 4. ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржбрж┐ржПржХржЯрж┐ржнрзЗржЯ ржХрж░рж╛
ржпржжрж┐ ржЖржкржирж┐ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржирж┐рж╖рзНржХрзНрж░рж┐рзЯ ржХрж░рждрзЗ ржЪрж╛ржи:

```bash
Switch(config-if)# no switchport port-security
```
```
Switch>
Switch>enable
Switch#config
Switch#configure te
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface fas
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#switchport port-security
Command rejected: FastEthernet0/1 is a dynamic port.
Switch(config-if)#switchport mode access
Switch(config-if)#switchport port-security
```
ржПржЯрж┐ ржорж╛ржирзЗ ржпрзЗ, ржЖржкржирж┐ ржпрзЗ ржЗржирзНржЯрж╛рж░ржлрзЗрж╕рзЗ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рждрзЗ ржЪрж╛ржЪрзНржЫрзЗржи, рж╕рзЗржЗ ржЗржирзНржЯрж╛рж░ржлрзЗрж╕ржЯрж┐ ржбрж╛ржЗржирж╛ржорж┐ржХ ржкрзЛрж░рзНржЯ рж╣рж┐рж╕рзЗржмрзЗ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рж╛ ржЖржЫрзЗ, ржпрж╛ ржнрж▓рзЗржЯрж╛ржЗрж▓ ржмрж╛ ржкрж░рж┐ржмрж░рзНрждржиржпрзЛржЧрзНржпред Cisco рж╕рзБржЗржЪрзЗ ржХрж┐ржЫрзБ ржкрзЛрж░рзНржЯрзЗ ржбрж╛ржЗржирж╛ржорж┐ржХ ржкрзЛрж░рзНржЯ ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржи ржерж╛ржХрждрзЗ ржкрж╛рж░рзЗ, ржПржмржВ ржПржЗ ржзрж░ржирзЗрж░ ржкрзЛрж░рзНржЯрзЗ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржкрзНрж░рзЯрзЛржЧ ржХрж░рж╛ ржпрж╛рзЯ ржирж╛ред

**рж╕ржорж╕рзНржпрж╛ рж╕ржорж╛ржзрж╛ржирзЗрж░ ржЬржирзНржп рж╕ржорж╛ржзрж╛ржи:**
- ржЗржирзНржЯрж╛рж░ржлрзЗрж╕ржЯрж┐ржХрзЗ Access Mode ржП рж╕рзНржпрзБржЗржЪ ржХрж░рзБржи:

 - ржкрзНрж░ржержорзЗ ржЖржкржирж╛ржХрзЗ ржЗржирзНржЯрж╛рж░ржлрзЗрж╕ржЯрж┐ржХрзЗ access mode ржП рж╕рзЗржЯ ржХрж░рждрзЗ рж╣ржмрзЗред ржПрж░ржкрж░ ржЖржкржирж┐ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рждрзЗ ржкрж╛рж░ржмрзЗржиред
   ржирж┐рж░рзНржжрзЗрж╢ржирж╛:
   ```bash
      Switch(config)#interface FastEthernet0/1
      Switch(config-if)#switchport mode access
   ```
- ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рзБржи:
     ржПржЦржи, ржЖржкржирж┐ рж╕рж╣ржЬрзЗржЗ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рждрзЗ ржкрж╛рж░ржмрзЗржиред
  ```bash
      Switch(config-if)#switchport port-security
  ```
```bash
Switch(config-if)#switchport port-security ?
  aging        Port-security aging commands
  mac-address  Secure mac address
  maximum      Max secure addresses
  violation    Security violation mode
  <cr>
Switch(config-if)#switchport port-security maxi
Switch(config-if)#switchport port-security maximum ?
  <1-132>  Maximum addresses
Switch(config-if)#switchport port-security maximum 1
```
switchport port-security maximum 1 ржХржорж╛ржирзНржбржЯрж┐ ржмрзНржпржмрж╣рж╛рж░ ржХрж░рзЗ ржЖржкржирж┐ ржПржХржЯрж┐ ржкрзЛрж░рзНржЯрзЗ рж╕рж░рзНржмрж╛ржзрж┐ржХ 1ржЯрж┐ MAC ржарж┐ржХрж╛ржирж╛ ржЕржирзБржорзЛржжрж┐ржд ржХрж░рждрзЗ ржкрж╛рж░рзЗржиред

ржПржЯрж┐рж░ ржорж╛ржзрзНржпржорзЗ ржЖржкржирж┐ ржирж┐рж░рзНржжрж┐рж╖рзНржЯ ржХрж░рзЗ ржжрзЗржи ржпрзЗ, ржР ржкрзЛрж░рзНржЯрзЗ ржХрзЗржмрж▓ 1ржЯрж┐ ржбрж┐ржнрж╛ржЗрж╕рзЗрж░ MAC ржарж┐ржХрж╛ржирж╛ ржХрж╛ржирзЗржХрзНржЯ рж╣рждрзЗ ржкрж╛рж░ржмрзЗред ржпржжрж┐ ржЕржирзНржп ржХрзЛржирзЛ MAC ржарж┐ржХрж╛ржирж╛ ржУржЗ ржкрзЛрж░рзНржЯрзЗ рж╕ржВржпрзБржХрзНржд рж╣рзЯ, рждржмрзЗ ржПржЯрж┐ ржПржХржЯрж┐ ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи рж╕рзГрж╖рзНржЯрж┐ ржХрж░ржмрзЗ, ржПржмржВ рж╕рзЗржЯрж┐ ржирж┐рж░рзНржзрж╛рж░рж┐ржд ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи ржЕрзНржпрж╛ржХрж╢ржи ржЕржирзБржпрж╛рзЯрзА (ржпрзЗржоржи: Shutdown, Protect, ржмрж╛ Restrict) ржХрж╛ржЬ ржХрж░ржмрзЗред

ржЖржЗржкрж┐ ржЯрзЗрж▓рж┐ржлрзЛржи ржПржмржВ ржкрж┐рж╕рж┐рж░ ржЬржирзНржп  ржР ржкрзЛрж░рзНржЯрзЗ ржХрзЗржмрж▓ 2ржЯрж┐ ржбрж┐ржнрж╛ржЗрж╕рзЗрж░ MAC ржарж┐ржХрж╛ржирж╛ ржХрж╛ржирзЗржХрзНржЯ рж╣рждрзЗ ржкрж╛рж░ржмрзЗред
```bash
Switch(config-if)#switchport port-security maximum 2
```
**ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи (Port Security Violation)** рж╣рж▓рзЛ рж╕рзЗржЗ ржШржЯржирж╛ ржпржЦржи ржХрзЛржирзЛ ржкрзЛрж░рзНржЯрзЗ ржЕржирзБржорзЛржжрж┐ржд MAC ржарж┐ржХрж╛ржирж╛ ржЫрж╛рзЬрж╛ ржЕржирзНржп ржХрзЛржирзЛ ржбрж┐ржнрж╛ржЗрж╕ рж╕ржВржпрзБржХрзНржд рж╣рзЯред ржПржЯрж┐ **ржирзЗржЯржУрзЯрж╛рж░рзНржХ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐** ржмрж╛рзЬрж╛ржирзЛрж░ ржЬржирзНржп ржЧрзБрж░рзБрждрзНржмржкрзВрж░рзНржг, ржХрж╛рж░ржг ржПржЯрж┐ ржЕржкрзНрж░рждрзНржпрж╛рж╢рж┐ржд ржмрж╛ ржЕржмрж╛ржЮрзНржЫрж┐ржд ржбрж┐ржнрж╛ржЗрж╕ржЧрзБрж▓рзЛржХрзЗ ржкрзЛрж░рзНржЯрзЗ рж╕ржВржпрзЛржЧ ржХрж░рждрзЗ ржмрж╛ржзрж╛ ржжрзЗрзЯред

- **ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи ржХрж┐ржнрж╛ржмрзЗ ржХрж╛ржЬ ржХрж░рзЗ?**

ржпржЦржи ржПржХржЯрж┐ ржбрж┐ржнрж╛ржЗрж╕ ржПржХржЯрж┐ ржкрзЛрж░рзНржЯрзЗ рж╕ржВржпрзБржХрзНржд рж╣рзЯ, рж╕рж┐рж╕рзНржХрзЛ рж╕рзБржЗржЪ **MAC ржарж┐ржХрж╛ржирж╛** рж╢ржирж╛ржХрзНржд ржХрж░рзЗред ржпржжрж┐ ржР ржкрзЛрж░рзНржЯрзЗрж░ ржЬржирзНржп ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рж╛ MAC ржарж┐ржХрж╛ржирж╛рж░ рж╕рж╛ржерзЗ ржирждрзБржи ржХрзЛржирзЛ MAC ржарж┐ржХрж╛ржирж╛ ржорж┐рж▓ ржирж╛ ржЦрж╛рзЯ, рждржмрзЗ рж╕рзЗржЯрж┐ **ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи** рж╣рж┐рж╕рзЗржмрзЗ ржЧржгрзНржп рж╣рзЯред ржПржмржВ ржПрж░ржкрж░ рж╕рзНржпрзБржЗржЪ ржпрзЗржЗ **ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи ржЕрзНржпрж╛ржХрж╢ржи** ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рж╛ ржерж╛ржХрзЗ, рждрж╛ ржЕржирзБржпрж╛рзЯрзА ржмрзНржпржмрж╕рзНржерж╛ ржирзЗрзЯред

- **ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи ржЕрзНржпрж╛ржХрж╢ржи**

рж╕рж┐рж╕рзНржХрзЛ рж╕рзБржЗржЪрзЗ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи ржШржЯрж▓рзЗ рждрж┐ржи ржзрж░ржирзЗрж░ ржЕрзНржпрж╛ржХрж╢ржи ржирзЗрзЯрж╛ ржпрж╛рзЯ:

1. **Protect**:
   - ржЕржЬрж╛ржирж╛ MAC ржарж┐ржХрж╛ржирж╛рж░ ржкрзНржпрж╛ржХрзЗржЯ ржбрзНрж░ржк ржХрж░рж╛ рж╣рзЯ, рждржмрзЗ ржХрзЛржирзЛ ржирзЛржЯрж┐ржлрж┐ржХрзЗрж╢ржи ржкрж╛ржарж╛ржирзЛ рж╣рзЯ ржирж╛ред
   
   ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржи:
   ```bash
   switchport port-security violation protect
   ```

2. **Restrict**:
   - ржЕржЬрж╛ржирж╛ MAC ржарж┐ржХрж╛ржирж╛рж░ ржкрзНржпрж╛ржХрзЗржЯ ржбрзНрж░ржк ржХрж░рж╛ рж╣рзЯ ржПржмржВ рж╕рзНржпрзБржЗржЪ ржПржХржЯрж┐ ржирзЛржЯрж┐ржлрж┐ржХрзЗрж╢ржи (syslog) ржкрж╛ржарж╛рзЯред
   
   ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржи:
   ```bash
   switchport port-security violation restrict
   ```

3. **Shutdown (ржбрж┐ржлрж▓рзНржЯ ржЕржкрж╢ржи)**:
   - ржкрзЛрж░рзНржЯржЯрж┐ рж╕рзНржмржпрж╝ржВржХрзНрж░рж┐ржпрж╝ржнрж╛ржмрзЗ **рж╢рж╛ржЯржбрж╛ржЙржи** рж╣рзЯрзЗ ржпрж╛рзЯ ржПржмржВ ржХрзЛржи ржкрзНржпрж╛ржХрзЗржЯ ржкрж╛рж╕ ржХрж░рждрзЗ ржкрж╛рж░рзЗ ржирж╛ред ржПржЯрж┐ рж╕ржмржЪрзЗржпрж╝рзЗ ржХрзЬрж╛ ржирж┐рж░рж╛ржкрждрзНрждрж╛ред
   
   ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржи:
   ```bash
   switchport port-security violation shutdown
   ```

**ржЙржжрж╛рж╣рж░ржг ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржи:**
ржзрж░рж╛ ржпрж╛ржХ, ржЖржкржирж┐ ржпржжрж┐ FastEthernet0/1 ржкрзЛрж░рзНржЯрзЗ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рждрзЗ ржЪрж╛ржи ржПржмржВ ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи ржШржЯрж▓рзЗ ржкрзЛрж░рзНржЯржЯрж┐ ржмржирзНржз (shutdown) ржХрж░рждрзЗ ржЪрж╛ржи, рждрж╛рж╣рж▓рзЗ ржХржиржлрж┐ржЧрж╛рж░рзЗрж╢ржи рж╣ржмрзЗ:

```bash
Switch(config)#interface FastEthernet0/1
Switch(config-if)#switchport mode access
Switch(config-if)#switchport port-security
Switch(config-if)#switchport port-security maximum 1
Switch(config-if)#switchport port-security violation shutdown
Switch(config-if)#switchport port-security mac-address sticky
```

ржПржЦрж╛ржирзЗ:
- **`switchport port-security violation shutdown`**: ржпржжрж┐ ржЕржирзНржп ржХрзЛржирзЛ ржЕржЬрж╛ржирж╛ MAC ржарж┐ржХрж╛ржирж╛ ржкрзЛрж░рзНржЯрзЗ ржпрзБржХрзНржд рж╣рзЯ, ржкрзЛрж░рзНржЯржЯрж┐ ржмржирзНржз рж╣рзЯрзЗ ржпрж╛ржмрзЗ (shutdown)ред
- **`switchport port-security maximum 1`**: ржПржХрзЗ рж╕рзАржорж┐ржд ржХрж░рж╛ рж╣ржмрзЗ рззржЯрж┐ MAC ржарж┐ржХрж╛ржирж╛рзЯред
- **`switchport port-security mac-address sticky`**: ржпрзЗржЗ MAC ржарж┐ржХрж╛ржирж╛ ржкрзНрж░ржержорзЗ рж╕ржВржпрзБржХрзНржд рж╣ржмрзЗ, рж╕рзЗржЧрзБрж▓рзЛ рж╕рж┐рж╕рзНржЯрзЗржорзЗ ржЕржЯрзЛржорзЗржЯрж┐ржХрзНржпрж╛рж▓рж┐ рж╕ржВрж░ржХрзНрж╖рж┐ржд рж╣ржмрзЗред

**ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи ржЪрзЗржХ ржХрж░рж╛:**
ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи ржШржЯрзЗ ржерж╛ржХрж▓рзЗ рждрж╛рж░ ржмрж┐рж╕рзНрждрж╛рж░рж┐ржд ржЬрж╛ржирж╛рж░ ржЬржирзНржп ржЖржкржирж┐ ржирж┐ржЪрзЗрж░ ржХржорж╛ржирзНржбржЯрж┐ ржмрзНржпржмрж╣рж╛рж░ ржХрж░рждрзЗ ржкрж╛рж░рзЗржи:
```bash
show port-security
show port-security interface FastEthernet0/1
```

ржПржЯрж┐ ржЖржкржирж╛ржХрзЗ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐рж░ ржмрж░рзНрждржорж╛ржи рж╕рзНржЯрзНржпрж╛ржЯрж╛рж╕ ржПржмржВ ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи рждржерзНржп ржжрзЗржЦрж╛ржмрзЗред

### ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи рж╕ржорзНржкрж░рзНржХрзЗ рж╕ржЪрзЗрждржирждрж╛:
- **ржкрзЛрж░рзНржЯ рж╢рж╛ржЯржбрж╛ржЙржи** (shutdown) ржЕржмрж╕рзНржерж╛ржпрж╝, ржкрзЛрж░рзНржЯржЯрж┐ ржкрзБржирж░рж╛ржпрж╝ **enable** ржХрж░рждрзЗ рж╣ржмрзЗред ржПржЯрж┐ ржХрж░рждрзЗ:
  ```bash
  Switch(config)#interface FastEthernet0/1
  Switch(config-if)#shutdown
  Switch(config-if)#no shutdown
  ```

ржПржЗржнрж╛ржмрзЗ ржЖржкржирж┐ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржнрж╛рзЯрзЛрж▓рзЗрж╢ржи ржХржиржлрж┐ржЧрж╛рж░ ржПржмржВ ржорзНржпрж╛ржирзЗржЬ ржХрж░рждрзЗ ржкрж╛рж░ржмрзЗржиред

ржЖржкржирж╛рж░ ржпржжрж┐ ржЖрж░рзЛ ржХрзЛржирзЛ ржкрзНрж░рж╢рзНржи ржерж╛ржХрзЗ ржмрж╛ ржХрзЛржирзЛ ржЕржВрж╢рзЗ рж╕рж╛рж╣рж╛ржпрзНржп ржкрзНрж░рзЯрзЛржЬржи рж╣рзЯ, рждрж╛рж╣рж▓рзЗ ржЖржорж╛ржХрзЗ ржЬрж╛ржирж╛рждрзЗ ржкрж╛рж░рзЗржи! ЁЯШК
ржПржЗ рж╕рзНржЯрзЗржкржЧрзБрж▓рж┐ ржмрзНржпржмрж╣рж╛рж░ ржХрж░рзЗ ржЖржкржирж┐ рж╕рж┐рж╕рзНржХрзЛ рж╕рзБржЗржЪрзЗ ржкрзЛрж░рзНржЯ рж╕рж┐ржХрж┐ржЙрж░рж┐ржЯрж┐ ржХржиржлрж┐ржЧрж╛рж░ ржХрж░рждрзЗ ржкрж╛рж░рзЗржиред
