# SSH কনফিগার
Cisco switch-এ SSH কনফিগার করার জন্য নিচের স্টেপগুলো অনুসরণ করুন:

### ১. **হোস্টনেম এবং ডোমেইন নাম সেট করুন:**
SSH ব্যবহারের জন্য সুইচের হোস্টনেম এবং ডোমেইন নাম কনফিগার করা প্রয়োজন।

```bash
Switch# configure terminal
Switch(config)# hostname YourSwitchName
Switch(config)# ip domain-name yourdomain.com
```

### ২. **RSA কী জেনারেট করুন:**
SSH এনক্রিপশন ব্যবহৃত হয়, তাই নিরাপদ যোগাযোগের জন্য RSA কী জেনারেট করতে হবে।

```bash
Switch(config)# crypto key generate rsa
```
আপনি যখন কী সাইজের জন্য প্রম্পট পাবেন, তখন কমপক্ষে ১০২৪ বিট নির্বাচন করুন (২০৪৮ বিট নিরাপত্তার জন্য ভালো)।

```bash
The key modulus size is 2048
```

### ৩. **SSH সংস্করণ ২ সক্রিয় করুন:**
Cisco সুইচগুলি SSH সংস্করণ ১ এবং সংস্করণ ২ উভয়ই সাপোর্ট করে, তবে সংস্করণ ২ নিরাপদ। SSH সংস্করণ ২ সক্রিয় করতে নিচের কমান্ড ব্যবহার করুন:

```bash
Switch(config)# ip ssh version 2
```

### ৪. **একটি ব্যবহারকারীর নাম এবং পাসওয়ার্ড তৈরি করুন:**
SSH লগইন অ্যাক্সেসের জন্য একটি ব্যবহারকারীর নাম এবং পাসওয়ার্ড তৈরি করতে হবে।

```bash
Switch(config)# username yourusername privilege 15 secret yourpassword
```
- `privilege 15` পুরো প্রশাসনিক অ্যাক্সেস দেয়।
- `yourusername` এবং `yourpassword` পরিবর্তন করে আপনার পছন্দসই ব্যবহারকারীর নাম এবং পাসওয়ার্ড দিন।

### ৫. **VTY লাইনগুলিকে SSH অ্যাক্সেসের জন্য সক্ষম করুন:**
VTY লাইনগুলিতে SSH অ্যাক্সেস সক্ষম করতে হবে।

```bash
Switch(config)# line vty 0 15
Switch(config-line)# transport input ssh
Switch(config-line)# login local
```
এখানে, `line vty 0 15` মানে ০ থেকে ১৫ পর্যন্ত সকল VTY লাইন কনফিগার করা হবে।

### ৬. **SSH এর জন্য সুইচ রিবুট করুন:**
সব কনফিগারেশন করার পর, SSH অ্যাক্সেস পরীক্ষা করতে সুইচ রিবুট করতে পারেন বা শুধু SSH ব্যবহার করে সুইচে লগইন করার চেষ্টা করুন।

এখন আপনি SSH দিয়ে সুইচে লগইন করতে পারবেন। SSH ক্লায়েন্টের মাধ্যমে আপনার সুইচের IP ব্যবহার করে লগইন করুন:

```bash
ssh yourusername@Switch_IP_address
```

 ### উদাহরণ

```bash
Switch>enable
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Switch(config)#hostname ? [হোস্টনেম]
  WORD  This system's network name
Switch(config)#hostname cisco
cisco(config)#
cisco(config)#ip domain?
domain  domain-lookup  domain-name  
cisco(config)#ip domain-n
cisco(config)#ip domain-name ? [ ডোমেইন নাম]
  WORD  Default domain name
cisco(config)#ip domain-name cisco.com?
WORD  
cisco(config)#ip domain-name cisco.com
cisco(config)#
cisco(config)#crypto ? [*RSA কী জেনারেট]
  key  Long term key operations
cisco(config)#crypto key ?
  generate  Generate new keys
  zeroize   Remove keys
cisco(config)#crypto key gene
cisco(config)#crypto key generate ?
  rsa  Generate RSA keys
cisco(config)#crypto key generate rs
cisco(config)#crypto key generate rsa ?
  general-keys  Generate a general purpose RSA key pair for signing and
                encryption
  <cr>
cisco(config)#crypto key generate rsa 
The name for the keys will be: cisco.cisco.com
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 512
% Generating 512 bit RSA keys, keys will be non-exportable...[OK]

cisco(config)#
cisco(config)# ip ?
*Mar 1 0:4:30.372: RSA key size needs to be at least 768 bits for ssh version 2
*Mar 1 0:4:30.372: %SSH-5-ENABLED: SSH 1.5 has been enabled
  access-list      Named access-list
  arp              IP ARP global configuration
  default-gateway  Specify default gateway (if not routing IP)
  dhcp             Configure DHCP server and relay parameters
  domain           IP DNS Resolver
  domain-lookup    Enable IP Domain Name System hostname translation
  domain-name      Define the default domain name
  ftp              FTP configuration commands
  host             Add an entry to the ip hostname table
  name-server      Specify address of name server to use
  scp              Scp commands
  ssh              Configure ssh options
cisco(config)# ip ssh ?  [SSH ]
  authentication-retries  Specify number of authentication retries
  time-out                Specify SSH time-out interval
  version                 Specify protocol version to be supported
cisco(config)# ip ssh ver
cisco(config)# ip ssh version ?
  <1-2>  Protocol version
cisco(config)# ip ssh version 2
Please create RSA keys (of at least 768 bits size) to enable SSH v2.
cisco(config)#username ?  [username & Password]
  WORD  User name
cisco(config)#username cisco?
WORD  
cisco(config)#username cisco ?
  password   Specify the password for the user
  privilege  Set user privilege level
  secret     Specify the secret for the user
  <cr>
cisco(config)#username cisco se
cisco(config)#username cisco secret ? 
  0     Specifies an UNENCRYPTED secret will follow
  5     Specifies a HIDDEN secret will follow
  LINE  The UNENCRYPTED (cleartext) user secret
cisco(config)#username cisco secret cisco
cisco(config)#
cisco(config)#do show run
Building configuration...

Current configuration : 1178 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname cisco
!
!
!
ip ssh version 1
ip domain-name cisco.com
!
username cisco secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0   [username & passsowrd]
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
 --More-- 
cisco(config)#do show ip interface brief 
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual up                    up 
FastEthernet0/2        unassigned      YES manual down                  down 
FastEthernet0/3        unassigned      YES manual down                  down 
FastEthernet0/4        unassigned      YES manual down                  down 
FastEthernet0/5        unassigned      YES manual down                  down 
FastEthernet0/6        unassigned      YES manual down                  down 
FastEthernet0/7        unassigned      YES manual down                  down 
FastEthernet0/8        unassigned      YES manual down                  down 
FastEthernet0/9        unassigned      YES manual down                  down 
FastEthernet0/10       unassigned      YES manual down                  down 
FastEthernet0/11       unassigned      YES manual down                  down 
FastEthernet0/12       unassigned      YES manual down                  down 
FastEthernet0/13       unassigned      YES manual down                  down 
FastEthernet0/14       unassigned      YES manual down                  down 
FastEthernet0/15       unassigned      YES manual down                  down 
FastEthernet0/16       unassigned      YES manual down                  down 
FastEthernet0/17       unassigned      YES manual down                  down 
FastEthernet0/18       unassigned      YES manual down                  down 
FastEthernet0/19       unassigned      YES manual down                  down 
FastEthernet0/20       unassigned      YES manual down                  down 
FastEthernet0/21       unassigned      YES manual down                  down 
FastEthernet0/22       unassigned      YES manual down                  down 
FastEthernet0/23       unassigned      YES manual down                  down 
FastEthernet0/24       unassigned      YES manual down                  down 
GigabitEthernet0/1     unassigned      YES manual down                  down 
GigabitEthernet0/2     unassigned      YES manual down                  down 
Vlan1                  unassigned      YES manual administratively down down

cisco(config)#interface
cisco(config)#interface vlan 1
cisco(config-if)#no shutdown

cisco(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up

cisco(config-if)#do show ip interface brief 
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual up                    up 
FastEthernet0/2        unassigned      YES manual down                  down 
FastEthernet0/3        unassigned      YES manual down                  down 
FastEthernet0/4        unassigned      YES manual down                  down 
FastEthernet0/5        unassigned      YES manual down                  down 
FastEthernet0/6        unassigned      YES manual down                  down 
FastEthernet0/7        unassigned      YES manual down                  down 
FastEthernet0/8        unassigned      YES manual down                  down 
FastEthernet0/9        unassigned      YES manual down                  down 
FastEthernet0/10       unassigned      YES manual down                  down 
FastEthernet0/11       unassigned      YES manual down                  down 
FastEthernet0/12       unassigned      YES manual down                  down 
FastEthernet0/13       unassigned      YES manual down                  down 
FastEthernet0/14       unassigned      YES manual down                  down 
FastEthernet0/15       unassigned      YES manual down                  down 
FastEthernet0/16       unassigned      YES manual down                  down 
FastEthernet0/17       unassigned      YES manual down                  down 
FastEthernet0/18       unassigned      YES manual down                  down 
FastEthernet0/19       unassigned      YES manual down                  down 
FastEthernet0/20       unassigned      YES manual down                  down 
FastEthernet0/21       unassigned      YES manual down                  down 
FastEthernet0/22       unassigned      YES manual down                  down 
FastEthernet0/23       unassigned      YES manual down                  down 
FastEthernet0/24       unassigned      YES manual down                  down 
GigabitEthernet0/1     unassigned      YES manual down                  down 
GigabitEthernet0/2     unassigned      YES manual down                  down 
Vlan1                  unassigned      YES manual up                    up

cisco(config-if)#ip address 192.168.0.2 255.255.255.0
cisco(config-if)#do show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual up                    up 
FastEthernet0/2        unassigned      YES manual down                  down 
FastEthernet0/3        unassigned      YES manual down                  down 
FastEthernet0/4        unassigned      YES manual down                  down 
FastEthernet0/5        unassigned      YES manual down                  down 
FastEthernet0/6        unassigned      YES manual down                  down 
FastEthernet0/7        unassigned      YES manual down                  down 
FastEthernet0/8        unassigned      YES manual down                  down 
FastEthernet0/9        unassigned      YES manual down                  down 
FastEthernet0/10       unassigned      YES manual down                  down 
FastEthernet0/11       unassigned      YES manual down                  down 
FastEthernet0/12       unassigned      YES manual down                  down 
FastEthernet0/13       unassigned      YES manual down                  down 
FastEthernet0/14       unassigned      YES manual down                  down 
FastEthernet0/15       unassigned      YES manual down                  down 
FastEthernet0/16       unassigned      YES manual down                  down 
FastEthernet0/17       unassigned      YES manual down                  down 
FastEthernet0/18       unassigned      YES manual down                  down 
FastEthernet0/19       unassigned      YES manual down                  down 
FastEthernet0/20       unassigned      YES manual down                  down 
FastEthernet0/21       unassigned      YES manual down                  down 
FastEthernet0/22       unassigned      YES manual down                  down 
FastEthernet0/23       unassigned      YES manual down                  down 
FastEthernet0/24       unassigned      YES manual down                  down 
GigabitEthernet0/1     unassigned      YES manual down                  down 
GigabitEthernet0/2     unassigned      YES manual down                  down 
Vlan1                  192.168.0.2     YES manual up                    up
cisco(config)#ip default-gateway 192.168.0.1
cisco(config)#line vty 0 15
cisco(config-line)#password ?
  7     Specifies a HIDDEN password will follow
  LINE  The UNENCRYPTED (cleartext) line password
cisco(config-line)#password cisco
cisco(config-line)#login
cisco(config-line)#exit
cisco(config-line)#password ?
  7     Specifies a HIDDEN password will follow
  LINE  The UNENCRYPTED (cleartext) line password
cisco(config-line)#password cisco
cisco(config-line)#login
cisco(config-line)#exit
cisco(config)#enable secret cisco
cisco(config)#service passw
cisco(config)#service password-encryption 
cisco(config)#do show run 
Building configuration...

Current configuration : 1320 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
!
hostname cisco
!
enable secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0
!
!
!
ip ssh version 1
ip domain-name cisco.com
!
username cisco secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
!
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
!
interface FastEthernet0/16
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
!
interface GigabitEthernet0/2
!
interface Vlan1
 ip address 192.168.0.2 255.255.255.0
!
ip default-gateway 192.168.0.1
!
!
!
!
line con 0
!
line vty 0 4
 password 7 0822455D0A16
 login
line vty 5 15
 password 7 0822455D0A16
 login
!
!
!
!
end

cisco(config)#line vty 0 15  [ssh/telnet allow]
cisco(config-line)#trans
cisco(config-line)#tra
cisco(config-line)#transport ?
  input   Define which protocols to use when connecting to the terminal server
  output  Define which protocols to use for outgoing connections
cisco(config-line)#transport inpu
cisco(config-line)#transport input ?
  all     All protocols
  none    No protocols
  ssh     TCP/IP SSH protocol
  telnet  TCP/IP Telnet protocol
cisco(config-line)# transport input all 
cisco(config-line)# do show run
Building configuration...

Current configuration : 1320 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
!
hostname cisco
!
enable secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0
!
!
!
ip ssh version 1
ip domain-name cisco.com
!
username cisco secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
!
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
!
interface FastEthernet0/16
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
!
interface GigabitEthernet0/2
!
interface Vlan1
 ip address 192.168.0.2 255.255.255.0
!
ip default-gateway 192.168.0.1
!
!
!
!
line con 0
!
line vty 0 4
 password 7 0822455D0A16
 login
line vty 5 15
 password 7 0822455D0A16
 login
!
!
!
!
end
```

এই ছিলো SSH কনফিগারেশন প্রক্রিয়া!
# পোর্ট সিকিউরিটি
সিস্কো পোর্ট সিকিউরিটি কনফিগার করার জন্য নিম্নলিখিত স্টেপগুলি অনুসরণ করতে পারেন:

### 1. পোর্ট সিকিউরিটি সক্রিয় করা
প্রথমে, আপনাকে পোর্টটি সিলেক্ট করতে হবে যেটি সিকিউরিটি কনফিগার করতে চান। এরপর, আপনি সেই পোর্টে সিকিউরিটি অ্যাক্টিভেট করবেন। উদাহরণস্বরূপ, যদি আপনি ইথারনেট পোর্ট 0/1 ব্যবহার করেন, তাহলে:

```bash
Switch(config)# interface fastEthernet 0/1
Switch(config-if)# switchport port-security
```
### Violation Shutdown
**পোর্ট সিকিউরিটি ভায়োলেশন (Port Security Violation)** হলো সেই ঘটনা যখন কোনো পোর্টে অনুমোদিত MAC ঠিকানা ছাড়া অন্য কোনো ডিভাইস সংযুক্ত হয়। এটি **নেটওয়ার্ক সিকিউরিটি** বাড়ানোর জন্য গুরুত্বপূর্ণ, কারণ এটি অপ্রত্যাশিত বা অবাঞ্ছিত ডিভাইসগুলোকে পোর্টে সংযোগ করতে বাধা দেয়।

- **পোর্ট সিকিউরিটি ভায়োলেশন কিভাবে কাজ করে?**

যখন একটি ডিভাইস একটি পোর্টে সংযুক্ত হয়, সিস্কো সুইচ **MAC ঠিকানা** শনাক্ত করে। যদি ঐ পোর্টের জন্য কনফিগার করা MAC ঠিকানার সাথে নতুন কোনো MAC ঠিকানা মিল না খায়, তবে সেটি **ভায়োলেশন** হিসেবে গণ্য হয়। এবং এরপর স্যুইচ যেই **ভায়োলেশন অ্যাকশন** কনফিগার করা থাকে, তা অনুযায়ী ব্যবস্থা নেয়।

- **পোর্ট সিকিউরিটি ভায়োলেশন অ্যাকশন**

সিস্কো সুইচে পোর্ট সিকিউরিটি ভায়োলেশন ঘটলে তিন ধরনের অ্যাকশন নেয়া যায়:

1. **Protect**:
   - অজানা MAC ঠিকানার প্যাকেট ড্রপ করা হয়, তবে কোনো নোটিফিকেশন পাঠানো হয় না।
   
   কনফিগারেশন:
   ```bash
   switchport port-security violation protect
   ```

2. **Restrict**:
   - অজানা MAC ঠিকানার প্যাকেট ড্রপ করা হয় এবং স্যুইচ একটি নোটিফিকেশন (syslog) পাঠায়।
   
   কনফিগারেশন:
   ```bash
   switchport port-security violation restrict
   ```

3. **Shutdown (ডিফল্ট অপশন)**:
   - পোর্টটি স্বয়ংক্রিয়ভাবে **শাটডাউন** হয়ে যায় এবং কোন প্যাকেট পাস করতে পারে না। এটি সবচেয়ে কড়া নিরাপত্তা।
   
   কনফিগারেশন:
   ```bash
   switchport port-security violation shutdown
   ```

**উদাহরণ কনফিগারেশন:**
ধরা যাক, আপনি যদি FastEthernet0/1 পোর্টে পোর্ট সিকিউরিটি কনফিগার করতে চান এবং ভায়োলেশন ঘটলে পোর্টটি বন্ধ (shutdown) করতে চান, তাহলে কনফিগারেশন হবে:

```bash
Switch(config)#interface FastEthernet0/1
Switch(config-if)#switchport mode access
Switch(config-if)#switchport port-security
Switch(config-if)#switchport port-security maximum 1
Switch(config-if)#switchport port-security violation shutdown
Switch(config-if)#switchport port-security mac-address sticky
```

এখানে:
- **`switchport port-security violation shutdown`**: যদি অন্য কোনো অজানা MAC ঠিকানা পোর্টে যুক্ত হয়, পোর্টটি বন্ধ হয়ে যাবে (shutdown)।
- **`switchport port-security maximum 1`**: একে সীমিত করা হবে ১টি MAC ঠিকানায়।
- **`switchport port-security mac-address sticky`**: যেই MAC ঠিকানা প্রথমে সংযুক্ত হবে, সেগুলো সিস্টেমে অটোমেটিক্যালি সংরক্ষিত হবে।

**পোর্ট সিকিউরিটি ভায়োলেশন চেক করা:**
ভায়োলেশন ঘটে থাকলে তার বিস্তারিত জানার জন্য আপনি নিচের কমান্ডটি ব্যবহার করতে পারেন:
```bash
show port-security
show port-security interface FastEthernet0/1
```

এটি আপনাকে পোর্ট সিকিউরিটির বর্তমান স্ট্যাটাস এবং ভায়োলেশন তথ্য দেখাবে।

### ভায়োলেশন সম্পর্কে সচেতনতা:
- **পোর্ট শাটডাউন** (shutdown) অবস্থায়, পোর্টটি পুনরায় **enable** করতে হবে। এটি করতে:
  ```bash
  Switch(config)#interface FastEthernet0/1
  Switch(config-if)#shutdown
  Switch(config-if)#no shutdown
  ```
### Violation Shutdown Troubleshooting:
যদি পোর্টটি **err-disable** হয়ে যায়, তাহলে এটি চেক করতে পারেন:

```bash
Switch# show interface status err-disabled
```

এবং পোর্টটি পুনরায় সক্রিয় করতে:

```bash
Switch# show port-security interface fastEthernet 0/1
Switch# clear port-security sticky interface fastEthernet 0/1
```

এভাবে, **Violation Shutdown** পোর্ট সিকিউরিটির একটি গুরুত্বপূর্ণ অংশ যা নেটওয়ার্কের নিরাপত্তা নিশ্চিত করে।
### 2. পোর্ট সিকিউরিটির নিয়ম সেট করা
আপনার পোর্ট সিকিউরিটির জন্য কিছু প্যারামিটার কনফিগার করতে হবে, যেমন:

- **ম্যাক অ্যাড্রেস সীমা**: কতটি MAC অ্যাড্রেস পোর্টে অনুমোদিত হবে
- **অ্যাকশন**: যদি কোনো নিষিদ্ধ ডিভাইস পোর্টে সংযুক্ত হয় তাহলে কি হবে (সেটআপ করা যেতে পারে "restrict", "protect", বা "shutdown" অ্যাকশন)
- **MAC অ্যাড্রেস লক করা**: পোর্টে ম্যানুয়ালি নির্দিষ্ট MAC অ্যাড্রেস সেট করা।
- **Port Security Sticky Mode** সিস্কো সুইচে একটি ফিচার যা পোর্টে সংযুক্ত MAC অ্যাড্রেসগুলোকে **স্বয়ংক্রিয়ভাবে সুরক্ষিত** করে রাখে। এই মোডে, যখন একটি ডিভাইস প্রথমবারের মতো একটি পোর্টে সংযুক্ত হয়, তখন পোর্টটি ঐ ডিভাইসের MAC অ্যাড্রেসটিকে "sticky" হিসেবে স্মরণ করে রাখে। এর মানে হলো, সিস্কো সুইচ ঐ MAC অ্যাড্রেসটিকে পোর্ট সিকিউরিটির তালিকায় অস্থায়ীভাবে যোগ করে এবং ভবিষ্যতে ঐ MAC অ্যাড্রেসটি শুধুমাত্র ঐ পোর্টে ব্যবহৃত হতে পারে।

Sticky মোডে কনফিগার করলে, ডিভাইসটির MAC অ্যাড্রেসটি সেই পোর্টে স্টোর হয়ে যায় এবং পুনরায় সুইচ রিস্টার্ট হলে, সিস্টেম ঐ MAC অ্যাড্রেসগুলো আবারও স্বয়ংক্রিয়ভাবে পুনরুদ্ধার করে, এর ফলে নতুন করে MAC অ্যাড্রেস যুক্ত করার প্রয়োজন হয় না।

#### Sticky Mode-এর সুবিধা:
1. **স্বয়ংক্রিয় MAC অ্যাড্রেস সংরক্ষণ**: আপনি যখন কোনো ডিভাইস সংযুক্ত করেন, তখন ঐ ডিভাইসের MAC অ্যাড্রেস পোর্টে স্বয়ংক্রিয়ভাবে যুক্ত হয়ে যায়।
2. **সুরক্ষা**: এটি পোর্টে শুধুমাত্র অনুমোদিত MAC অ্যাড্রেসগুলো সংযুক্ত থাকতে নিশ্চিত করে, ফলে নকল বা অননুমোদিত ডিভাইসের সংযোগ বন্ধ হয়ে যায়।
3. **কনফিগারেশন সহজ করা**: আপনি ম্যানুয়ালি MAC অ্যাড্রেস কনফিগার না করে, শুধুমাত্র Sticky মোড ব্যবহার করে সমস্ত MAC অ্যাড্রেস কনফিগার করতে পারেন।

#### Sticky Mode-এর কাজের পদ্ধতি:
- যখন একটি ডিভাইস প্রথমবার পোর্টে সংযুক্ত হয়, তখন ঐ MAC অ্যাড্রেসটি সিস্কো সুইচে `sticky` হিসেবে সংরক্ষিত হয়ে যায়।
- ঐ MAC অ্যাড্রেসটির পরে যদি পোর্টে আরেকটি ডিভাইস সংযুক্ত করা হয় যার MAC অ্যাড্রেসটি আগে থেকেই স্টোর করা থাকে, তবে ঐ ডিভাইসটি পোর্টে কাজ করবে।
- যদি ঐ MAC অ্যাড্রেসটির সীমা পার হয়ে যায় বা অন্য কোনো অননুমোদিত MAC অ্যাড্রেস সংযুক্ত হয়, তখন নির্দিষ্ট অ্যাকশন যেমন `restrict`, `shutdown`, বা `protect` কার্যকর হয়।

#### Sticky Mode কনফিগার করার উদাহরণ:
```bash
Switch(config)# interface fastEthernet 0/1
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security maximum 2
Switch(config-if)# switchport port-security violation restrict
```

এভাবে, **Sticky Mode** পোর্ট সিকিউরিটির মাধ্যমে আপনাকে স্বয়ংক্রিয়ভাবে সুরক্ষিত MAC অ্যাড্রেস ব্যবস্থাপনা করতে সাহায্য করে।
#### উদাহরণ:
1. পোর্টে একমাত্র একটি MAC অ্যাড্রেস অনুমোদিত হবে:
```bash
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation restrict
```

2. একটি নির্দিষ্ট MAC অ্যাড্রেস কনফিগার করা:
```bash
Switch(config-if)# switchport port-security mac-address 0010.1234.5678
```

3. পোর্ট সিকিউরিটি নিষিদ্ধ করার জন্য:
```bash
Switch(config-if)# switchport port-security violation shutdown
```

#### 3. পোর্ট সিকিউরিটি স্ট্যাটাস চেক করা
আপনি পোর্ট সিকিউরিটির বর্তমান স্ট্যাটাস দেখতে চাইলে নিচের কমান্ড ব্যবহার করতে পারেন:

```bash
Switch# show port-security interface fastEthernet 0/1
```

#### 4. পোর্ট সিকিউরিটি ডিএকটিভেট করা
যদি আপনি পোর্ট সিকিউরিটি নিষ্ক্রিয় করতে চান:

```bash
Switch(config-if)# no switchport port-security
```
**উদাহরণ**
```
Switch>
Switch>enable
Switch#config
Switch#configure te
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface fas
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#switchport port-security
Command rejected: FastEthernet0/1 is a dynamic port.
Switch(config-if)#switchport mode access
Switch(config-if)#switchport port-security
```
এটি মানে যে, আপনি যে ইন্টারফেসে পোর্ট সিকিউরিটি কনফিগার করতে চাচ্ছেন, সেই ইন্টারফেসটি ডাইনামিক পোর্ট হিসেবে কনফিগার করা আছে, যা ভলেটাইল বা পরিবর্তনযোগ্য। Cisco সুইচে কিছু পোর্টে ডাইনামিক পোর্ট কনফিগারেশন থাকতে পারে, এবং এই ধরনের পোর্টে পোর্ট সিকিউরিটি প্রয়োগ করা যায় না।

**সমস্যা সমাধানের জন্য সমাধান:**
- ইন্টারফেসটিকে Access Mode এ স্যুইচ করুন:

 - প্রথমে আপনাকে ইন্টারফেসটিকে access mode এ সেট করতে হবে। এরপর আপনি পোর্ট সিকিউরিটি কনফিগার করতে পারবেন।
   নির্দেশনা:
   ```bash
      Switch(config)#interface FastEthernet0/1
      Switch(config-if)#switchport mode access
   ```
- পোর্ট সিকিউরিটি কনফিগার করুন:
     এখন, আপনি সহজেই পোর্ট সিকিউরিটি কনফিগার করতে পারবেন।
  ```bash
      Switch(config-if)#switchport port-security
  ```
```bash
Switch(config-if)#switchport port-security ?
  aging        Port-security aging commands
  mac-address  Secure mac address
  maximum      Max secure addresses
  violation    Security violation mode
  <cr>
Switch(config-if)#switchport port-security maxi
Switch(config-if)#switchport port-security maximum ?
  <1-132>  Maximum addresses
Switch(config-if)#switchport port-security maximum 1
Switch(config-if)#switchport port-security maximum 2
```
switchport port-security maximum 1 কমান্ডটি ব্যবহার করে আপনি একটি পোর্টে সর্বাধিক 1টি MAC ঠিকানা অনুমোদিত করতে পারেন।

এটির মাধ্যমে আপনি নির্দিষ্ট করে দেন যে, ঐ পোর্টে কেবল 1টি ডিভাইসের MAC ঠিকানা কানেক্ট হতে পারবে। যদি অন্য কোনো MAC ঠিকানা ওই পোর্টে সংযুক্ত হয়, তবে এটি একটি ভায়োলেশন সৃষ্টি করবে, এবং সেটি নির্ধারিত ভায়োলেশন অ্যাকশন অনুযায়ী (যেমন: Shutdown, Protect, বা Restrict) কাজ করবে।

আইপি টেলিফোন এবং পিসির জন্য  ঐ পোর্টে কেবল 2টি ডিভাইসের MAC ঠিকানা কানেক্ট হতে পারবে।

```bash
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#swit
Switch(config-if)#switchport por
Switch(config-if)#switchport port-security ?
  aging        Port-security aging commands
  mac-address  Secure mac address
  maximum      Max secure addresses
  violation    Security violation mode
  <cr>
Switch(config-if)#switchport port-security vio
Switch(config-if)#switchport port-security violation ?
  protect   Security violation protect mode
  restrict  Security violation restrict mode
  shutdown  Security violation shutdown mode
Switch(config-if)#switchport port-security violation shutdo
Switch(config-if)#switchport port-security violation shutdown 
Switch(config-if)#switchport port-security mac
Switch(config-if)#switchport port-security mac-address ?
  H.H.H   48 bit mac address
  sticky  Configure dynamic secure addresses as sticky
Switch(config-if)#switchport port-security mac-address sti
Switch(config-if)#switchport port-security mac-address sticky
Switch(config-if)#do sh mac add
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

   1    0001.c7ad.88d7    DYNAMIC     Fa0/3
   1    000b.be53.27b3    STATIC      Fa0/1
   1    0030.f276.6c65    DYNAMIC     Fa0/2
   1    0090.21ce.31b1    DYNAMIC     Fa0/4


Switch(config-if)# do sh run
Building configuration...

Current configuration : 1272 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Switch
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
 switchport mode access
 switchport port-security
 switchport port-security maximum 2
 switchport port-security mac-address sticky 
 switchport port-security mac-address sticky 000B.BE53.27B3
!
--More--

Switch(config-if)#do sh port-security
Secure Port MaxSecureAddr CurrentAddr SecurityViolation Security Action
               (Count)       (Count)        (Count)
--------------------------------------------------------------------
        Fa0/1        2          1                 0         Shutdown
----------------------------------------------------------------------
Switch(config-if)#^Z
Switch#
%SYS-5-CONFIG_I: Configured from console by console
Switch#show port-security ?
  address    Show secure address
  interface  Show secure interface
  <cr>
Switch#show port-security inter
Switch#show port-security interface ?
  Ethernet         IEEE 802.3
  FastEthernet     FastEthernet IEEE 802.3
  GigabitEthernet  GigabitEthernet IEEE 802.3z
Switch#show port-security interface F
Switch#show port-security interface FastEthernet 
Switch#show port-security interface FastEthernet ?
  <0-9>  FastEthernet interface number
Switch#show port-security interface FastEthernet 0?
/  
Switch#show port-security interface FastEthernet 0/1
Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 2
Total MAC Addresses        : 1
Configured MAC Addresses   : 0
Sticky MAC Addresses       : 1
Last Source Address:Vlan   : 000B.BE53.27B3:1
Security Violation Count   : 0

%%%%%if we change condition&&&&&&&
Switch#show port-security interface FastEthernet 0/1
Port Security              : Enabled
Port Status                : Secure-shutdown
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 2
Total MAC Addresses        : 2
Configured MAC Addresses   : 0
Sticky MAC Addresses       : 2
Last Source Address:Vlan   : 0090.21CE.31B1:1
Security Violation Count   : 1
Switch#show ip int brief
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual down                  down 
FastEthernet0/2        unassigned      YES manual up                    up 
FastEthernet0/3        unassigned      YES manual up                    up 
FastEthernet0/4        unassigned      YES manual up                    up 
FastEthernet0/5        unassigned      YES manual down                  down 
FastEthernet0/6        unassigned      YES manual down                  down 
FastEthernet0/7        unassigned      YES manual down                  down 
FastEthernet0/8        unassigned      YES manual down                  down 
FastEthernet0/9        unassigned      YES manual down                  down 
FastEthernet0/10       unassigned      YES manual down                  down 
FastEthernet0/11       unassigned      YES manual down                  down 
FastEthernet0/12       unassigned      YES manual down                  down 
FastEthernet0/13       unassigned      YES manual down                  down 
FastEthernet0/14       unassigned      YES manual down                  down 
FastEthernet0/15       unassigned      YES manual down                  down 
FastEthernet0/16       unassigned      YES manual down                  down 
FastEthernet0/17       unassigned      YES manual down                  down 
FastEthernet0/18       unassigned      YES manual down                  down 
FastEthernet0/19       unassigned      YES manual down                  down 
FastEthernet0/20       unassigned      YES manual down                  down 
FastEthernet0/21       unassigned      YES manual down                  down 
FastEthernet0/22       unassigned      YES manual down                  down 
FastEthernet0/23       unassigned      YES manual down                  down 
FastEthernet0/24       unassigned      YES manual down                  down 
GigabitEthernet0/1     unassigned      YES manual down                  down 
GigabitEthernet0/2     unassigned      YES manual down                  down 
Vlan1                  unassigned      YES manual administratively down down

Switch#show inter fastEthernet 0/1
FastEthernet0/1 is down, line protocol is down **(err-disabled)**
  Hardware is Lance, address is 00e0.a363.5c01 (bia 00e0.a363.5c01)
 BW 100000 Kbit, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 100Mb/s
  input flow-control is off, output flow-control is off
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:08, output 00:00:05, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue :0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     956 packets input, 193351 bytes, 0 no buffer
     Received 956 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     0 watchdog, 0 multicast, 0 pause input
     0 input packets with dribble condition detected
     2357 packets output, 263570 bytes, 0 underruns
     0 output errors, 0 collisions, 10 interface resets
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier
     0 output buffer failures, 0 output buffers swapped out
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inter
Switch(config)#interface fa
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#show por
Switch(config-if)#shu
Switch(config-if)#shutdown 

%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to administratively down
Switch(config-if)#do sh ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual administratively down down 
--More--

Switch(config-if)#no shutdown 

Switch(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

Switch(config-if)#do sh ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual up                    up 
--More--
Switch(config-if)#do sh port inter f0/1
Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 2
Total MAC Addresses        : 2
Configured MAC Addresses   : 0
Sticky MAC Addresses       : 2
Last Source Address:Vlan   : 0090.21CE.31B1:1
Security Violation Count   : 0
```
এই স্টেপগুলি ব্যবহার করে আপনি সিস্কো সুইচে পোর্ট সিকিউরিটি কনফিগার করতে পারেন।

# স্পিড এবং ডুপ্লেক্স সেটিংস 
আপনি যদি বলছেন যে সুইচের নেটওয়ার্ক স্লো হয়ে যাচ্ছে স্পিড এবং ডুপ্লেক্স সেটিংসের কারণে, তাহলে এটা বেশ সাধারণ একটি সমস্যা হতে পারে। স্পিড এবং ডুপ্লেক্স হল নেটওয়ার্ক ডাটা ট্রান্সফারের গতি এবং মেথড। যদি এগুলোর মধ্যে মিসম্যাচ হয়, তাহলে স্লো কানেকশন বা ডাটা ট্রান্সফারের সমস্যা হতে পারে। নিচে কিছু বিষয় বিস্তারিতভাবে দেওয়া হলো:

### ১. **স্পিড (Speed)**:
এটি হল ডাটা ট্রান্সফারের গতি। সাধারণত স্পিড ১০ Mbps, ১০০ Mbps, ১ Gbps ইত্যাদি হয়ে থাকে। যদি এক ডিভাইস ১ Gbps এ সেট করা থাকে এবং অন্যটি ১০০ Mbps এ, তাহলে কানেকশন স্লো হতে পারে।

### ২. **ডুপ্লেক্স (Duplex)**:
ডুপ্লেক্স হল ডাটা ট্রান্সফারের কিভাবে হবে তা নির্ধারণ করে। 
- **হাফ-ডুপ্লেক্স (Half-duplex)**: এক সময় শুধু ডাটা পাঠানো অথবা গ্রহণ করা যাবে।
- **ফুল-ডুপ্লেক্স (Full-duplex)**: একই সময়ে পাঠানো এবং গ্রহণ করা সম্ভব, যা দ্রুত ডাটা ট্রান্সফার নিশ্চিত করে।

### সমস্যার সমাধান:
- **মিসম্যাচিং সেটিংস**: যদি এক ডিভাইস অটো-নেগোশিয়েট (Auto-Negotiate) এ সেট করা থাকে এবং অন্যটি একটি নির্দিষ্ট স্পিড বা ডুপ্লেক্সে সেট করা থাকে, তাহলে সঠিকভাবে সিঙ্ক না হওয়ায় স্লো কানেকশন হতে পারে। উভয় ডিভাইসে স্পিড এবং ডুপ্লেক্স সঠিকভাবে সেট আছে কিনা, তা চেক করুন।
  
- **অটো-নেগোশিয়েট ব্যবহার করুন**: বেশিরভাগ ক্ষেত্রে, উভয় ডিভাইসকে অটো-নেগোশিয়েট (Auto-Negotiate) সেট করলে এটি স্বয়ংক্রিয়ভাবে সঠিক স্পিড এবং ডুপ্লেক্স মেলাতে সাহায্য করবে।

- **ম্যানুয়ালি সেট করুন**: যদি অটো-নেগোশিয়েট কাজ না করে, তাহলে উভয় ডিভাইসে স্পিড এবং ডুপ্লেক্স ম্যানুয়ালি একই করতে হবে।

- **কেবলের সমস্যা**: মাঝে মাঝে কেবলের কারণেও সমস্যা হতে পারে। যদি কেবলের মান ভালো না হয় বা কেবল ড্যামেজ হয়ে যায়, তাহলে নেটওয়ার্ক স্পিড স্লো হতে পারে। সঠিক ক্যাটেগরি (যেমন Cat5e, Cat6) কেবল ব্যবহার করা জরুরি।

আপনি কি ডিভাইসগুলোর স্পিড এবং ডুপ্লেক্স সেটিংস চেক করেছেন?
```bash
Switch1>
Switch1>enable
Switch1#config
Switch1#configure ter
Switch1#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(1config)#do sh ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual up                    up 
FastEthernet0/2        unassigned      YES manual up                    up 
FastEthernet0/3        unassigned      YES manual down                  down 
FastEthernet0/4        unassigned      YES manual down                  down 
FastEthernet0/5        unassigned      YES manual down                  down 
FastEthernet0/6        unassigned      YES manual down                  down 
FastEthernet0/7        unassigned      YES manual down                  down 
FastEthernet0/8        unassigned      YES manual down                  down 
FastEthernet0/9        unassigned      YES manual down                  down 
FastEthernet0/10       unassigned      YES manual down                  down 
FastEthernet0/11       unassigned      YES manual down                  down 
FastEthernet0/12       unassigned      YES manual down                  down 
FastEthernet0/13       unassigned      YES manual down                  down 
FastEthernet0/14       unassigned      YES manual down                  down 
FastEthernet0/15       unassigned      YES manual down                  down 
FastEthernet0/16       unassigned      YES manual down                  down 
FastEthernet0/17       unassigned      YES manual down                  down 
FastEthernet0/18       unassigned      YES manual down                  down 
FastEthernet0/19       unassigned      YES manual down                  down 
FastEthernet0/20       unassigned      YES manual down                  down 
FastEthernet0/21       unassigned      YES manual down                  down 
FastEthernet0/22       unassigned      YES manual down                  down 
FastEthernet0/23       unassigned      YES manual down                  down 
FastEthernet0/24       unassigned      YES manual down                  down 
GigabitEthernet0/1     unassigned      YES manual down                  down 
GigabitEthernet0/2     unassigned      YES manual down                  down 
Vlan1                  unassigned      YES manual administratively down down
Switch1(config)#int
Switch1(config)#interface fas
Switch1(config)#interface fastEthernet 0/1
Switch1(config-if)#speed ?
  10    Force 10 Mbps operation
  100   Force 100 Mbps operation
  auto  Enable AUTO speed configuration
Switch1(config-if)#speed  100 ?
  <cr>
Switch1(config-if)#speed  100 
Switch1(config-if)#duplex ?
  auto  Enable AUTO duplex configuration
  full  Force full duplex operation
  half  Force half-duplex operation
Switch1(config-if)#duplex full ?
  <cr>
Switch1(config-if)#duplex full 
Switch1(config-if)#
%LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down

Switch1(config-if)#do sh ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual down                  down 
FastEthernet0/2        unassigned      YES manual up                    up 
FastEthernet0/3        unassigned      YES manual down                  down 
FastEthernet0/4        unassigned      YES manual down                  down 
FastEthernet0/5        unassigned      YES manual down                  down 
FastEthernet0/6        unassigned      YES manual down                  down 
FastEthernet0/7        unassigned      YES manual down                  down 
FastEthernet0/8        unassigned      YES manual down                  down 
FastEthernet0/9        unassigned      YES manual down                  down 
FastEthernet0/10       unassigned      YES manual down                  down 
FastEthernet0/11       unassigned      YES manual down                  down 
FastEthernet0/12       unassigned      YES manual down                  down 
FastEthernet0/13       unassigned      YES manual down                  down 
FastEthernet0/14       unassigned      YES manual down                  down 
FastEthernet0/15       unassigned      YES manual down                  down 
FastEthernet0/16       unassigned      YES manual down                  down 
FastEthernet0/17       unassigned      YES manual down                  down 
FastEthernet0/18       unassigned      YES manual down                  down 
FastEthernet0/19       unassigned      YES manual down                  down 
FastEthernet0/20       unassigned      YES manual down                  down 
FastEthernet0/21       unassigned      YES manual down                  down 
 --More-- 
%LINK-3-UPDOWN: Interface FastEthernet0/2, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to down

%LINK-5-CHANGED: Interface FastEthernet0/2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up
FastEthernet0/22       unassigned      YES manual down                  down 
FastEthernet0/23       unassigned      YES manual down                  down 
FastEthernet0/24       unassigned      YES manual down                  down 
GigabitEthernet0/1     unassigned      YES manual down                  down 
GigabitEthernet0/2     unassigned      YES manual down                  down 
Vlan1                  unassigned      YES manual administratively down down
Switch1(config-if)#
Switch1(config-if)#

[for another switch]
Switch>
Switch>ena
Switch>enable 
Switch#conf
Switch#configure 
Configuring from terminal, memory, or network [terminal]? t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inter
Switch(config)#do sh ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/1        unassigned      YES manual down                  down 
FastEthernet0/2        unassigned      YES manual up                    up 
FastEthernet0/3        unassigned      YES manual down                  down 
FastEthernet0/4        unassigned      YES manual down                  down 
FastEthernet0/5        unassigned      YES manual down                  down 
FastEthernet0/6        unassigned      YES manual down                  down 
FastEthernet0/7        unassigned      YES manual down                  down 
FastEthernet0/8        unassigned      YES manual down                  down 
FastEthernet0/9        unassigned      YES manual down                  down 
FastEthernet0/10       unassigned      YES manual down                  down 
FastEthernet0/11       unassigned      YES manual down                  down 
FastEthernet0/12       unassigned      YES manual down                  down 
FastEthernet0/13       unassigned      YES manual down                  down 
FastEthernet0/14       unassigned      YES manual down                  down 
FastEthernet0/15       unassigned      YES manual down                  down 
FastEthernet0/16       unassigned      YES manual down                  down 
FastEthernet0/17       unassigned      YES manual down                  down 
FastEthernet0/18       unassigned      YES manual down                  down 
FastEthernet0/19       unassigned      YES manual down                  down 
FastEthernet0/20       unassigned      YES manual down                  down 
FastEthernet0/21       unassigned      YES manual down                  down 
FastEthernet0/22       unassigned      YES manual down                  down 
FastEthernet0/23       unassigned      YES manual down                  down 
FastEthernet0/24       unassigned      YES manual down                  down 
GigabitEthernet0/1     unassigned      YES manual down                  down 
GigabitEthernet0/2     unassigned      YES manual down                  down 
Vlan1                  unassigned      YES manual administratively down down
Switch(config)#inter
Switch(config)#interface fas
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#?
  authentication    Auth Manager Interface Configuration Commands
  cdp               Global CDP configuration subcommands
  channel-group     Etherchannel/port bundling configuration
  channel-protocol  Select the channel protocol (LACP, PAgP)
  description       Interface specific description
  dot1x             Interface Config Commands for IEEE 802.1X
  duplex            Configure duplex operation.
  exit              Exit from interface configuration mode
  ip                Interface Internet Protocol config commands
  lldp              LLDP interface subcommands
  mdix              Set Media Dependent Interface with Crossover
  mls               mls interface commands
  no                Negate a command or set its defaults
  shutdown          Shutdown the selected interface
  spanning-tree     Spanning Tree Subsystem
  speed             Configure speed operation.
  storm-control     storm configuration
  switchport        Set switching mode characteristics
  tx-ring-limit     Configure PA level transmit ring limit
Switch(config-if)#spee
Switch(config-if)#speed ?
  10    Force 10 Mbps operation
  100   Force 100 Mbps operation
  auto  Enable AUTO speed configuration
Switch(config-if)#speed 100
Switch(config-if)#speed 100 
Switch(config-if)#du
Switch(config-if)#duplex ?
  auto  Enable AUTO duplex configuration
  full  Force full duplex operation
  half  Force half-duplex operation
Switch(config-if)#duplex full
Switch(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

[now both switch is up]

Switch# show  interface fastEthernet 0/1
FastEthernet0/1 is up, line protocol is up (connected)
  Hardware is Lance, address is 00d0.bcb3.c801 (bia 00d0.bcb3.c801)
 BW 100000 Kbit, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 100Mb/s                                  [**speed/duplex**]
  input flow-control is off, output flow-control is off
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:08, output 00:00:05, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue :0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     956 packets input, 193351 bytes, 0 no buffer
     Received 956 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     0 watchdog, 0 multicast, 0 pause input
     0 input packets with dribble condition detected
     2357 packets output, 263570 bytes, 0 underruns
     0 output errors, 0 collisions, 10 interface resets                 [collision]
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier
     0 output buffer failures, 0 output buffers swapped out

```
# Late collision
**Late collision** সিসকো সুইচে সাধারণত একটি সমস্যা বোঝায়, যেখানে একটি **কলিশন** 512 বিট টাইম (যা প্রায় 64 বাইট) এর পরে ঘটেছে। ইথারনেট যোগাযোগে কলিশন হওয়া সাধারণত স্বাভাবিক, কিন্তু যদি এটি নির্ধারিত সময়ের পরে ঘটে, তবে সেটিকে **late collision** বলা হয়।

এখন, সিসকো সুইচে **late collision** কেন ঘটে এবং কীভাবে এটি সমাধান করা যায়, তা দেখে নেওয়া যাক:

### **Late Collision এর কারণ:**
1. **অতিরিক্ত কেবল দৈর্ঘ্য**: যদি কেবলটি খুব দীর্ঘ হয়, তবে সিগন্যালের প্যাকেট পৌঁছাতে দেরি হতে পারে এবং কলিশন সঠিক সময়ে সনাক্ত করা হয় না। ফলে late collision ঘটে।
   
2. **নেটওয়ার্ক কার্ড বা NIC ত্রুটি**: যদি কোনও ডিভাইসের নেটওয়ার্ক ইন্টারফেস কার্ড (NIC) ঠিকমতো কাজ না করে, তবে late collision হতে পারে।
   
3. **Duplex মিসম্যাচ**: এক পোর্টে যদি ফুল ডুপ্লেক্স এবং অন্য পোর্টে হাফ ডুপ্লেক্স থাকে, তবে এতে কলিশন হওয়ার সম্ভাবনা বাড়ে এবং সেটা late collision হিসেবে পরিচিত হয়।
   
4. **সুইচ পোর্ট সমস্যা**: সুইচের পোর্টে যদি কোনো সমস্যা থাকে, তবে তা late collision ঘটাতে পারে।

### **Late Collision এর প্রভাব:**
- নেটওয়ার্কের পারফরম্যান্স ধীরে ধীরে কমে যেতে পারে।
- প্যাকেট হারানো বা নেটওয়ার্কে সমস্যা সৃষ্টি হতে পারে।

### **Late Collision সমাধান:**
1. **কেবল চেক করা**: কেবলের দৈর্ঘ্য যদি বেশি হয়, তবে সেটি কমানো উচিত।
   
2. **হার্ডওয়্যার পরীক্ষা করা**: নেটওয়ার্ক কার্ড বা সুইচ পোর্টে কোনও সমস্যা থাকলে তা ঠিক করা।
   
3. **Duplex সেটিং ঠিক করা**: সুনিশ্চিত করুন যে দুইটি ডিভাইসের ডুপ্লেক্স মুড মিল আছে। অর্থাৎ, যদি একটি পোর্ট ফুল ডুপ্লেক্সে থাকে, তাহলে অপর পোর্টও ফুল ডুপ্লেক্সে থাকা উচিত।
   
4. **সুইচ কনফিগারেশন চেক করা**: সুইচের পোর্ট সেটিংস সঠিক কিনা তা যাচাই করা।

### **Cisco সুইচে Late Collision চেক করার জন্য কমান্ড:**
1. **show interface [interface]**: এই কমান্ড দিয়ে আপনি ইন্টারফেসের স্ট্যাটাস দেখতে পারবেন, যার মধ্যে late collision এর তথ্য থাকবে।

    উদাহরণ:
    ```bash
    show interface GigabitEthernet0/1
    ```
    এখানে "late collisions" এর সংখ্যা দেখতে পাবেন।

2. **clear counters**: এই কমান্ড দিয়ে আপনি কাউন্টার রিসেট করতে পারবেন এবং আবার পর্যবেক্ষণ করতে পারবেন।

    উদাহরণ:
    ```bash
    clear counters
    ```

এইভাবে আপনি সিসকো সুইচে late collision সমস্যা চিহ্নিত এবং সমাধান করতে পারবেন। আশা করি এটা আপনার জন্য সহায়ক হবে! কোনও প্রশ্ন থাকলে আমাকে জানাবেন।

**CRC (Cyclic Redundancy Check)** হলো একটি সাধারণ ত্রুটি সনাক্তকরণ পদ্ধতি যা ডেটা ট্রান্সমিশন বা সংরক্ষণে ব্যবহৃত হয়। সিসকো সুইচে **CRC error** সাধারণত তখন ঘটে যখন ডেটা প্যাকেটগুলি যাত্রাপথে বা পোর্টের মাধ্যমে গমনকালে ক্ষতিগ্রস্ত হয়।

### **CRC Error এর কারণ:**

1. **কেবল বা কানেকশন সমস্যা**: যদি কেবলটি ত্রুটিপূর্ণ বা নষ্ট হয়, তাহলে এটি CRC ত্রুটি ঘটাতে পারে।
   
2. **নেটওয়ার্ক ইন্টারফেস কার্ড (NIC) এর ত্রুটি**: একটি খারাপ NIC বা পোর্টও CRC ত্রুটি সৃষ্টি করতে পারে।
   
3. **ডুপ্লেক্স মিসম্যাচ**: এক পোর্ট যদি ফুল ডুপ্লেক্সে থাকে এবং অপর পোর্ট হাফ ডুপ্লেক্সে থাকে, তবে এটি CRC ত্রুটি সৃষ্টি করতে পারে।

4. **ভৌত বা পরিবেশগত সমস্যা**: যেমন, ইলেকট্রনিক বা তাপজনিত কারণে সিগন্যালের ক্ষতি, অথবা বৈদ্যুতিক গোলমাল (interference) হতে পারে CRC ত্রুটির কারণ।

### **CRC Error এর প্রভাব:**
- নেটওয়ার্কের পারফরম্যান্স কমে যেতে পারে।
- প্যাকেট হারানো বা সংযোগে স্থিরতা সমস্যা হতে পারে।
- নির্দিষ্ট ডিভাইস বা নেটওয়ার্কের অংশ কাজ করতে সমস্যা সৃষ্টি হতে পারে।

### **Cisco সুইচে CRC Error চেক করার জন্য কমান্ড:**

1. **show interface [interface]**: এই কমান্ড ব্যবহার করে আপনি একটি ইন্টারফেসের উপর CRC ত্রুটির তথ্য দেখতে পারেন।

   উদাহরণ:
   ```bash
   show interface GigabitEthernet0/1
   ```

   এখানে আপনি "input errors" এর অধীনে **CRC errors** দেখতে পারবেন। যদি CRC ত্রুটি থাকে, তবে সেটি নিশ্চিতভাবেই ইন্ডিকেট করে যে কিছু সমস্যা রয়েছে।

2. **clear counters**: এই কমান্ড দিয়ে আপনি কাউন্টার রিসেট করতে পারবেন এবং আবার চেক করতে পারবেন।

   উদাহরণ:
   ```bash
   clear counters
   ```

### **CRC Error সমাধান:**

1. **কেবল পরীক্ষা করুন**: কেবল বা কানেকশনের অবস্থা চেক করুন। ক্ষতিগ্রস্ত বা নষ্ট কেবল প্রতিস্থাপন করুন।
   
2. **Duplex settings চেক করুন**: নিশ্চিত করুন যে দুইটি পোর্টের ডুপ্লেক্স সেটিংস মিল রয়েছে। এক পোর্টে যদি ফুল ডুপ্লেক্স থাকে, অন্য পোর্টও ফুল ডুপ্লেক্স হতে হবে।

3. **NIC বা পোর্ট পরীক্ষা করুন**: যদি একটি পোর্ট বা NIC ত্রুটিপূর্ণ থাকে, তবে সেটি রিপ্লেস করুন বা পুনরায় কনফিগার করুন।

4. **পরিবেশগত বা ইলেকট্রনিক গোলমাল চেক করুন**: যদি কোনও বৈদ্যুতিক গোলমাল বা পরিবেশগত সমস্যা থাকে, তবে সেটা ঠিক করার চেষ্টা করুন।

### **উপসংহার:**
CRC ত্রুটি হচ্ছে একটি সিগন্যাল বা ডেটা ট্রান্সমিশনের মধ্যে সমস্যা, যা নেটওয়ার্কের পারফরম্যান্সে ব্যাপক প্রভাব ফেলতে পারে। সঠিক ডিভাইস এবং কনফিগারেশন যাচাই করলে CRC ত্রুটি সমাধান করা সম্ভব।

আশা করি এই ব্যাখ্যাটি আপনার জন্য সহায়ক ছিল! যদি আরও কিছু প্রশ্ন থাকে, নির্দ্বিধায় জানাবেন।

 # MAC অ্যাড্রেস টেবিল দেখা

![](Images/Mac-address-table.jpg)

 ```bash
Switch>
Switch>enable
Switch#show  mac
Switch#show  mac-add
Switch#show  mac-address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

   1    0001.42bb.9887    DYNAMIC     Fa0/1
   1    000a.41de.c901    DYNAMIC     Fa0/2
   1    0060.47bd.31cb    DYNAMIC     Fa0/2
   1    00d0.ffa5.826d    DYNAMIC     Fa0/2
   1    00e0.f780.a1e1    DYNAMIC     Fa0/2
   1    00e0.f95a.d6eb    DYNAMIC     Fa0/2
Switch#show  mac-address-table  ?
  dynamic     dynamic entry type
  interfaces  interface entry type
  static      static entry type
  <cr>
  Switch#show  cdp
Switch#show  cdp ?
  entry      Information for specific neighbor entry
  interface  CDP interface status and configuration
  neighbors  CDP neighbor entries
  <cr>
Switch#show  cdp ne
Switch#show  cdp neighbors 
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater, P - Phone
Device ID    Local Intrfce   Holdtme    Capability   Platform    Port ID
Switch       Fas 0/2          130            S       2960        Fas 0/1
Switch#

```
# CDP (Cisco Discovery Protocol)
Cisco CDP (Cisco Discovery Protocol) হল একটি প্রটোকল যা Cisco ডিভাইসগুলোকে একে অপরের সম্পর্কে তথ্য শেয়ার করতে সাহায্য করে। এটি ল্যান (LAN) বা ওয়াইড অ্যারিয়া নেটওয়ার্ক (WAN)-এ একটি ডিভাইসের সাথে সংযুক্ত অন্যান্য Cisco ডিভাইসের তথ্য আবিষ্কার করতে ব্যবহার করা হয়।

CDP দিয়ে আপনি নেটওয়ার্কের মধ্যে অন্যান্য Cisco ডিভাইসের তথ্য যেমন তাদের মডেল, IP ঠিকানা, পোর্টের নাম, এবং অন্যান্য তথ্য দেখতে পারেন।

### CDP দেখতে:
Cisco ডিভাইসে CDP তথ্য দেখতে হলে আপনি CLI তে এই কমান্ডটি ব্যবহার করতে পারেন:

```
show cdp neighbors
```

এই কমান্ডটি আপনাকে নেটওয়ার্কে সংযুক্ত অন্যান্য Cisco ডিভাইসের সংক্ষিপ্ত তথ্য দেখাবে।

### CDP এর বিস্তারিত তথ্য দেখতে:
```
show cdp neighbors detail
```

এই কমান্ডটি আপনাকে আরও বিস্তারিত তথ্য দেখাবে যেমন ডিভাইসের মডেল, IP ঠিকানা, পোর্ট, এবং আরো কিছু।

### CDP বন্ধ/চালু করা:
আপনি যদি CDP বন্ধ বা চালু করতে চান, তাহলে এই কমান্ডগুলি ব্যবহার করতে পারেন:

- CDP চালু করতে:
  ```
  cdp run
  ```

- CDP বন্ধ করতে:
  ```
  no cdp run
  ```

CDP সাধারণত ব্যবহারকারীকে নেটওয়ার্কের সংযুক্ত ডিভাইসগুলো দ্রুত সনাক্ত করতে সাহায্য করে, যা নেটওয়ার্ক ট্রাবলশুটিং এবং কনফিগারেশন ম্যানেজমেন্টে কাজে আসে।

### CDP (Cisco Discovery Protocol) – সিস্কো ডিসকভারি প্রোটোকল

**CDP** (Cisco Discovery Protocol) হল একটি প্রোটোকল যা **Cisco** দ্বারা তৈরি এবং ব্যবহৃত হয়, যার মাধ্যমে নেটওয়ার্কে থাকা **Cisco ডিভাইস**গুলো একে অপরের সম্পর্কে তথ্য সংগ্রহ এবং শেয়ার করতে পারে। এটি **লিংক লেয়ার প্রোটোকল**, অর্থাৎ ডেটা লিংক লেয়ারে কাজ করে, এবং **নেটওয়ার্কে একে অপরের অবস্থান ও কনফিগারেশন সম্পর্কে তথ্য শেয়ার** করতে সহায়তা করে।

### CDP কিভাবে কাজ করে:
CDP সিস্টেমে থাকা সিস্কো ডিভাইসগুলো (যেমন রাউটার, সুইচ, ওয়্যারলেস এক্সেস পয়েন্ট ইত্যাদি) একে অপরের সাথে **নির্বাচিত তথ্য শেয়ার** করে, যেমন:
- ডিভাইসের নাম
- ডিভাইসের আইপি ঠিকানা
- পোর্ট নাম
- ডিভাইসের টাইপ
- সফটওয়্যার ভার্সন
- ম্যাক অ্যাড্রেস

এই তথ্যগুলো একে অপরের সাথে শেয়ার হওয়ার মাধ্যমে, নেটওয়ার্কে থাকা অন্যান্য ডিভাইসগুলো সহজেই সংযোগের তথ্য জানতে পারে এবং নেটওয়ার্ক টপোলজি সম্পর্কে ধারণা পেতে পারে।

### CDP এর সুবিধা:
1. **নেটওয়ার্ক ডিভাইস শনাক্তকরণ:** CDP ব্যবহার করে, একটি সিস্কো ডিভাইস সহজেই নেটওয়ার্কে সংযুক্ত অন্য সিস্কো ডিভাইসগুলোর তথ্য শনাক্ত করতে পারে।
2. **নেটওয়ার্ক টপোলজি ম্যানেজমেন্ট:** CDP এর মাধ্যমে নেটওয়ার্কের টপোলজি এবং ডিভাইস সংযোগের অবস্থান সম্পর্কে ধারণা পাওয়া যায়।
3. **ট্রাবলশুটিং সহজ করা:** যদি কোনো সমস্যা হয়, তবে CDP এর মাধ্যমে আপনি তাড়াতাড়ি সমস্যার উৎস শনাক্ত করতে পারবেন।
4. **অটোমেটিক ডিভাইস শনাক্তকরণ:** CDP পোর্ট বা লিংক পরিবর্তন হলে এটি ডিভাইসের তথ্য আপডেট করে, যাতে নেটওয়ার্ক প্রশাসকরা দ্রুত পরিবর্তনের বিষয়ে জানাতে পারেন।

### CDP এর সীমাবদ্ধতা:
- **সর্বোচ্চ 1 Hop:** CDP সাধারণত শুধুমাত্র এক হপ (hop) দূরের ডিভাইসের তথ্য শেয়ার করে। অর্থাৎ, CDP একে অপরের সাথে সংযুক্ত সরাসরি ডিভাইসগুলোর মধ্যে কাজ করে।
- **সর্বোচ্চ এক্সেস:** শুধুমাত্র সিস্কো ডিভাইসের মধ্যে এটি কাজ করে, অন্য ব্র্যান্ডের ডিভাইসের সাথে এটি কাজ করবে না।

### CDP কমান্ড উদাহরণ:
- **show cdp neighbors**: এই কমান্ডটি দিয়ে আপনি দেখতে পারবেন নেটওয়ার্কে আপনার ডিভাইসের সাথে সংযুক্ত সিস্কো ডিভাইসগুলোর তালিকা।
- **show cdp entry [device name]**: একটি নির্দিষ্ট ডিভাইসের বিস্তারিত তথ্য দেখতে।

### সারাংশ:
CDP হল সিস্কো ডিভাইসগুলোর মধ্যে স্বয়ংক্রিয়ভাবে তথ্য শেয়ার করার জন্য ব্যবহৃত একটি প্রোটোকল, যা নেটওয়ার্কে ডিভাইস শনাক্তকরণ, টপোলজি ম্যানেজমেন্ট, এবং ট্রাবলশুটিং সহজ করে তোলে।

এটি যদি আরও বিস্তারিতভাবে জানতে চান বা কোনো প্রশ্ন থাকে, জানাতে পারেন!

### LLDP (Link Layer Discovery Protocol) – লিংক লেয়ার ডিসকভারি প্রোটোকল

**LLDP** (Link Layer Discovery Protocol) একটি **অপেন স্ট্যান্ডার্ড প্রোটোকল** যা নেটওয়ার্কে থাকা ডিভাইসগুলোকে একে অপরের সম্পর্কে তথ্য শেয়ার করতে সহায়তা করে। এটি **IEEE 802.1AB স্ট্যান্ডার্ড** অনুসরণ করে এবং বিভিন্ন ব্র্যান্ডের নেটওয়ার্ক ডিভাইসের মধ্যে কাজ করে, যেমন সিস্কো, হিউই, জুনিপার, ডেল, এবং অন্যান্য ব্র্যান্ডের ডিভাইসগুলো। LLDP লিংক লেয়ার প্রোটোকল হওয়ায় এটি মূলত ডিভাইসগুলোর ম্যাক অ্যাড্রেস এবং নেটওয়ার্ক লিংক সম্পর্কিত তথ্য শেয়ার করে।

### LLDP কিভাবে কাজ করে:
LLDP ডিভাইসগুলো **লিংক লেয়ার** (Layer 2) এ তথ্য পাঠায়। এই তথ্যের মধ্যে থাকতে পারে:
- ডিভাইসের নাম
- ডিভাইসের আইপি ঠিকানা
- পোর্ট নাম
- ডিভাইসের টাইপ
- ম্যাক অ্যাড্রেস
- ডিভাইসের সাথে সংযুক্ত অন্য ডিভাইসের তথ্য
- VLAN বা অন্যান্য নেটওয়ার্ক কনফিগারেশন সম্পর্কিত তথ্য

LLDP প্রতিটি ডিভাইসে একটি নির্দিষ্ট সময় অন্তর (default 30 সেকেন্ড) তথ্য পাঠায় এবং অন্য ডিভাইসগুলো সেই তথ্য গ্রহণ করে। এটি শুধুমাত্র ডিভাইসের সাথে সরাসরি সংযুক্ত ডিভাইসগুলির তথ্য শেয়ার করে।

### LLDP এর সুবিধা:
1. **ভিন্ন ব্র্যান্ডের ডিভাইসের সাথে কাজ:** LLDP ওপেন স্ট্যান্ডার্ড হওয়ায় এটি সিস্কো ছাড়াও অন্যান্য ব্র্যান্ডের ডিভাইসগুলির সাথে কাজ করতে পারে। যেমন, হিউই, ডেল, জুনিপার ইত্যাদি।
2. **নেটওয়ার্ক টপোলজি শনাক্তকরণ:** LLDP ব্যবহার করে আপনি সহজেই নেটওয়ার্কের টপোলজি জানতে পারবেন, যেমন কোন ডিভাইসটি কোথায় সংযুক্ত রয়েছে।
3. **ট্রাবলশুটিং সহজতর:** যখন কোনো নেটওয়ার্ক সমস্যা দেখা দেয়, LLDP আপনাকে সমস্যার উৎস দ্রুত শনাক্ত করতে সহায়তা করে। 
4. **স্বয়ংক্রিয় ডিভাইস শনাক্তকরণ:** LLDP দ্বারা ডিভাইসগুলোর মধ্যে তথ্য আদান-প্রদান স্বয়ংক্রিয়ভাবে ঘটে, যা নেটওয়ার্ক কনফিগারেশন এবং ডিভাইস ম্যানেজমেন্ট সহজ করে তোলে।

### LLDP এর সীমাবদ্ধতা:
1. **শুধুমাত্র লিংক লেয়ার তথ্য:** LLDP শুধুমাত্র লিংক লেয়ার সম্পর্কিত তথ্য শেয়ার করে, যেমন পোর্ট এবং ম্যাক অ্যাড্রেস। এর মাধ্যমে আরো উচ্চ স্তরের (উদাহরণস্বরূপ, আইপি ঠিকানা) তথ্য পাওয়া সম্ভব নয়।
2. **নেটওয়ার্ক নিরাপত্তা ঝুঁকি:** LLDP এর মাধ্যমে ডিভাইসের সম্পর্কিত তথ্য শেয়ার করার কারণে, যদি সঠিকভাবে কনফিগার না করা হয় তবে এটি নেটওয়ার্কে নিরাপত্তা ঝুঁকি সৃষ্টি করতে পারে।

### LLDP কমান্ড উদাহরণ:
- **show lldp neighbors**: এই কমান্ডটি দিয়ে আপনি আপনার ডিভাইসের সাথে সংযুক্ত অন্য ডিভাইসগুলোর তালিকা দেখতে পারবেন।
- **show lldp entry [device name]**: একটি নির্দিষ্ট ডিভাইসের বিস্তারিত তথ্য দেখতে।

### LLDP এর ব্যবহার:
LLDP নেটওয়ার্কের বিভিন্ন ডিভাইসগুলোর মধ্যে **অটোমেটিক ডিভাইস শনাক্তকরণ এবং তথ্য শেয়ারিং** এর জন্য ব্যবহৃত হয়। এটি বিশেষভাবে উপকারী যখন ভিন্ন ভিন্ন ব্র্যান্ডের ডিভাইস একসাথে কাজ করে এবং নেটওয়ার্কের টপোলজি বা ডিভাইস কনফিগারেশন সম্পর্কে তথ্য জানা প্রয়োজন হয়।

### সারাংশ:
LLDP একটি ওপেন স্ট্যান্ডার্ড প্রোটোকল যা বিভিন্ন ব্র্যান্ডের ডিভাইসের মধ্যে **লিংক লেয়ার তথ্য শেয়ার করতে** ব্যবহৃত হয়। এটি নেটওয়ার্কের টপোলজি এবং ডিভাইসের সম্পর্কিত তথ্য জানা সহজ করে তোলে এবং ট্রাবলশুটিংকে আরও কার্যকরী করে।


# বুট আপ প্রক্রিয়া
আপনার ডিভাইসে চারটি বিল্ট-ইন মেমরি লোকেশন রয়েছে। প্রথমে, ROM (Read Only Memory) আছে, এরপর Flash মেমরি, পুরনো ডিভাইসে এটি মাদারবোর্ডের ক্যাশে তে ইনস্টল করা থাকে, নতুন ডিভাইসে এটি একটি রিমুভেবল CompactFlash কার্ড হয়। তারপর NVRAM (Non-Volatile RAM) এবং শেষমেষ RAM (Random Access Memory) রয়েছে। আপনি একটি বাহ্যিক USB মেমরি স্টিকও ডিভাইসে প্লাগ ইন করে ব্যবহার করতে পারেন।

ROM হলো প্রথম মেমরি যা ডিভাইস চালু হওয়ার সময় ব্যবহৃত হয়। ROM এর দুটি প্রধান কাজ আছে: প্রথমে Power On Self Test (POST) চালানো যা হার্ডওয়্যারের সমস্যা পরীক্ষা করে এবং তারপর bootstrap লোড করে। Bootstrap Flash মেমরিতে IOS সফটওয়্যার ইমেজ খুঁজে লোড করে। যদি Flash মেমরিতে কোনো IOS ইমেজ না পাওয়া যায়, তাহলে ডিভাইস ROMMON প্রম্পট দেখাবে, যার মানে হলো ডিভাইস বুট আপ করতে ব্যর্থ হয়েছে। ROMMON ব্যবহার করে আপনি হারানো বা দুর্নীতিগ্রস্ত সফটওয়্যার ইমেজ পুনরুদ্ধার করতে পারেন। এই ক্ষেত্রে, আপনি USB বা বাহ্যিক TFTP সার্ভার থেকে বুট করতে পারেন।

Flash মেমরি হলো যেখানে ডিভাইসের সফটওয়্যার ইমেজ সেভ থাকে। যখন ডিভাইস বুট হয়, এটি Flash থেকে প্রথম যে ইমেজটি পায়, সেটি লোড হয়, তবে আপনি ‘boot system’ কমান্ড ব্যবহার করে ইমেজটি ওভাররাইড করতে পারেন। ডিভাইসের ফ্যাক্টরি থেকে আসার সময় একটিই সফটওয়্যার ইমেজ থাকে, তবে আপনি সফটওয়্যার আপগ্রেড করে Flash এ নতুন ইমেজ কপি করতে পারেন, যার ফলে সেখানে দুইটি ইমেজ থাকতে পারে।

NVRAM হলো যেখানে ডিভাইসের স্টার্টআপ কনফিগ ফাইল সেভ থাকে। যখন সিস্টেম IOS সিস্টেম ইমেজ Flash থেকে লোড করে, তখন NVRAM থেকে স্টার্টআপ কনফিগ লোড হয়ে রানিং কনফিগে চলে আসে। যদি স্টার্টআপ কনফিগ ফাইল না থাকে, তাহলে সিস্টেম Setup Wizard লোড করবে।

অবশেষে, RAM (Random Access Memory) হলো ডিভাইসের সাধারণ কাজের মেমরি। IOS সিস্টেম ইমেজ এবং স্টার্টআপ কনফিগ RAM এ লোড হয়ে ডিভাইসের কাজ করে। RAM ভলাটাইল মেমরি হওয়ায় এটি পাওয়ার অফ বা রিবুট হলে ডাটা হারিয়ে ফেলে, তাই আমাদের প্রয়োজনীয় ফাইলগুলো স্থায়ীভাবে Flash বা NVRAM এ সংরক্ষণ করতে হয়।

এছাড়াও, VLAN ডেটাবেস (vlan.dat) সুইচে VLAN তথ্য সেভ করে থাকে এবং এটি Flash বা NVRAM এ রাখা হয়, সুইচের মডেলের ওপর নির্ভর করে। আপনি একটি বাহ্যিক TFTP সার্ভার থেকে সিস্টেম ইমেজ এবং/অথবা স্টার্টআপ কনফিগ লোড করতে পারেন, Flash বা NVRAM থেকে না, তবে এটি সুপারিশ করা হয় না, কারণ যদি ডিভাইসটি TFTP সার্ভারের সাথে সংযোগ হারায়, তাহলে ডিভাইসটি বুট করতে পারবে না। সুতরাং, একমাত্র পরিস্থিতি যেখানে আপনি এটি করবেন তা হল যদি আপনি একটি নতুন সিস্টেম ইমেজ লোড করতে চান এবং আপনার ডিভাইসে তা সংরক্ষণ করার জন্য যথেষ্ট Flash মেমরি নেই। সেক্ষেত্রে, আপনি এটি একটি বাহ্যিক TFTP সার্ভারে সেভ করতে পারেন এবং সেখান থেকে বুট করতে পারেন, তবে এটি সত্যিই সুপারিশ করা হয় না কারণ TFTP সার্ভারের সাথে সংযোগ হারালে আপনার ডিভাইসটি বুট হবে না। ঠিক আছে, এই ছিল সব তথ্য। এখন, সবকিছু ল্যাবে প্রদর্শন করার সময় এসেছে।

# ফ্যাক্টরি রিসেট
আপনি enable পাসওয়ার্ড হারিয়ে ফেলেন, তবে পাসওয়ার্ড রিকভারি কিভাবে করবেন। প্রথমে ফ্যাক্টরি রিসেট করা যাক। এটি করার পদ্ধতি খুবই সহজ; enable প্রম্পটে গিয়ে 'write erase' কমান্ড ব্যবহার করতে হবে। এটি স্টার্টআপ কনফিগ মুছে ফেলবে। এরপর, ডিভাইসটি রিলোড করতে হবে এবং এটি একটি ফাঁকা কনফিগারেশন নিয়ে বুট হবে। যেহেতু কোনো স্টার্টআপ কনফিগ নেই, সেহেতু Setup Wizard চলবে।
এখন ফ্যাক্টরি রিসেট করতে চাইলে 'write erase' কমান্ড ব্যবহার করবেন, যা NVRAM ফাইল সিস্টেম মুছে ফেলবে এবং স্টার্টআপ কনফিগ অপসারণ করবে। এরপর 'show start' দিলে দেখাবে যে স্টার্টআপ কনফিগ নেই এবং যদি 'reload' করেন, তাহলে ডিভাইসটি আবার বুট হবে Setup Wizard দিয়ে কারণ কোনো কনফিগারেশন নেই।
```cmd
enable
write erase
reload
```
```bash
Switch>
Switch>enable
Switch# configure terminal
Switch(config)# hostname host
hsot(config)# exit
host# write erase
host#reload 
Proceed with reload? [confirm]
C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(25r)FX, RELEASE SOFTWARE (fc4)
Cisco WS-C2960-24TT (RC32300) processor (revision C0) with 21039K bytes of memory.
2960-24TT starting...
Base ethernet MAC Address: 00D0.973C.E254
Xmodem file system is available.
Initializing Flash...
flashfs[0]: 1 files, 0 directories
flashfs[0]: 0 orphaned files, 0 orphaned directories
flashfs[0]: Total bytes: 64016384
flashfs[0]: Bytes used: 4670455
flashfs[0]: Bytes available: 59345929
flashfs[0]: flashfs fsck took 1 seconds.
...done Initializing Flash.

Boot Sector Filesystem (bs:) installed, fsid: 3
Parameter Block Filesystem (pb:) installed, fsid: 4


Loading "flash:/2960-lanbasek9-mz.150-2.SE4.bin"...
########################################################################## [OK]
Smart Init is enabled
smart init is sizing iomem
                  TYPE      MEMORY_REQ
                TOTAL:      0x00000000
Rounded IOMEM up to: 0Mb.
Using 6 percent iomem. [0Mb/512Mb]

              Restricted Rights Legend
Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.
           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706
Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE4, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Wed 26-Jun-13 02:49 by mnguyen
Initializing flashfs...
fsck: Disable shadow buffering due to heap fragmentation.
flashfs[2]: 2 files, 1 directories
flashfs[2]: 0 orphaned files, 0 orphaned directories
flashfs[2]: Total bytes: 32514048
flashfs[2]: Bytes used: 11952128
flashfs[2]: Bytes available: 20561920
flashfs[2]: flashfs fsck took 2 seconds.
flashfs[2]: Initialization complete....done Initializing flashfs.
Checking for Bootloader upgrade..
Boot Loader upgrade not required (Stage 2)
POST: CPU MIC register Tests : Begin
POST: CPU MIC register Tests : End, Status Passed
POST: PortASIC Memory Tests : Begin
POST: PortASIC Memory Tests : End, Status Passed
POST: CPU MIC interface Loopback Tests : Begin
POST: CPU MIC interface Loopback Tests : End, Status Passed
POST: PortASIC RingLoopback Tests : Begin
POST: PortASIC RingLoopback Tests : End, Status Passed
POST: PortASIC CAM Subsystem Tests : Begin
POST: PortASIC CAM Subsystem Tests : End, Status Passed
POST: PortASIC Port Loopback Tests : Begin
POST: PortASIC Port Loopback Tests : End, Status Passed
Waiting for Port download...Complete

This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.
A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html
If you require further assistance please contact us by sending email to
export@cisco.com.
cisco WS-C2960-24TT-L (PowerPC405) processor (revision B0) with 65536K bytes of memory.
Processor board ID FOC1010X104
Last reset from power-on
1 Virtual Ethernet interface
24 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.
64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:D0:97:3C:E2:54
Motherboard assembly number     : 73-10390-03
Power supply part number        : 341-0097-02
Motherboard serial number       : FOC10093R12
Power supply serial number      : AZS1007032H
Model revision number           : B0
Motherboard revision number     : B0
Model number                    : WS-C2960-24TT-L
System serial number            : FOC1010X104
Top Assembly Part Number        : 800-27221-02
Top Assembly Revision Number    : A0
Version ID                      : V02
CLEI Code Number                : COM3L00BRA
Hardware Board Revision Number  : 0x01

Switch Ports Model              SW Version            SW Image
------ ----- -----              ----------            ----------
*    1 26    WS-C2960-24TT-L    15.0(2)SE4            C2960-LANBASEK9-M

Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE4, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Wed 26-Jun-13 02:49 by mnguyen



Press RETURN to get started!


%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up


Switch>
```
# পাসওয়ার্ড রিকভারি রাউটার 
পাসওয়ার্ড রিকভারি করার জন্য প্রথমে আপনাকে কনফিগারেশন রেজিস্টার জানতে হবে, যা রাউটার বা সুইচের বুটিং পদ্ধতি পরিবর্তন করতে ব্যবহৃত হয়। আপনি 'config-register' কমান্ড ব্যবহার করতে পারেন গ্লোবাল কনফিগারেশন মোডে, অথবা যদি ডিভাইসটি রিবুট হওয়ার সময় ROMMON প্রম্পটে চলে আসে, তখন 'confreg' কমান্ড ব্যবহার করতে পারেন। উদাহরণস্বরূপ, 'config-register 0x2142' অথবা 'confreg 0x2142' ব্যবহার করলে সেটি স্টার্টআপ কনফিগ এর কন্টেন্ট উপেক্ষা করবে।অর্থাৎ এটি বুট হওয়ার সময় NVRAM-এর কনটেন্ট গুলি উপেক্ষা করবে। এর মানে হলো, স্টার্টআপ-কনফিগ ব্যবহার হবে না। এগুলোর মধ্যে সবচেয়ে সাধারণ যে তিনটি কনফিগারেশন ব্যবহার করা হয়, তা হল:
- 0x2102 যা ডিফল্ট রেজিস্টার,
- 0x2120 যা ROMMON মোডে বুট করবে, এবং
- 0x2142 যা NVRAM এর কন্টেন্ট উপেক্ষা করবে।
পাসওয়ার্ড রিকভারি শুরু করার জন্য, 
- প্রথমে আপনি ডিভাইসটি রিবুট করবেন। রিবুট করার সময়, কীবোর্ডে ব্রেক সিকোয়েন্স চাপবেন, যা সাধারণত Ctrl + Break হয়, তবে এটি আপনার ব্যবহৃত কনসোল সংযোগ সফটওয়্যারের উপর নির্ভর করে। যদি এটি Ctrl + Break না হয়, তবে গুগল করে খুঁজে নিতে পারেন।
- তারপর, ডিভাইসটি প্রথম এক মিনিটে পাওয়ার অন হওয়ার সময়, এটি ROMMON প্রম্পটে প্রবেশ করবে। সেখানে 'confreg 0x2142' কমান্ড দিন, যা বুট করার সময় স্টার্টআপ-কনফিগ উপেক্ষা করার নির্দেশ দেয়। স্টার্টআপ-কনফিগ এখনও সেখানে থাকবে, এবং ডিভাইসে পূর্বে কনফিগার করা সমস্ত কনফিগারেশন, যেমন আইপি অ্যাড্রেস এবং অন্যান্য সেটিংসও থাকবে। এছাড়া, enable secret এখনও সেখানে থাকবে, যা আপনি জানেন না, তবে রাউটার যখন বুট হবে তখন এটি স্টার্টআপ-কনফিগ ব্যবহার করবে না, তাই আপনাকে enable secret জানার দরকার হবে না।
-  এরপর ROMMON প্রম্পটে 'reset' কমান্ড দিন যাতে ডিভাইসটি বুট হয়। রাউটার কোন কনফিগারেশন ছাড়াই বুট হবে, ফলে সেটআপ উইজার্ড চালু হবে।
-   আপনি 'no' টাইপ করে সেটআপ উইজার্ডটি বাইপাস করতে পারবেন।
-   এরপর 'enable' কমান্ড দিয়ে enable মোডে প্রবেশ করুন। এখন, আপনি enable secret এর জন্য প্রম্পট পাবেন না, কারণ এটি বর্তমান রানিং-কনফিগে নেই, যা এখন খালি।
-   এখন, আপনাকে স্টার্টআপ-কনফিগ রানিং-কনফিগে কপি করতে হবে। এই পদক্ষেপটি ভুলবেন না। যদি আপনি এই পদক্ষেপটি ভুলে যান এবং অন্যান্য সমস্ত নির্দেশনা সঠিকভাবে অনুসরণ করেন, তবে আপনি ডিভাইসটি ফ্যাক্টরি রিসেট করে ফেলবেন এবং পূর্ববর্তী কনফিগ হারিয়ে ফেলবেন। যদি আপনি পাসওয়ার্ড রিকভারি করছেন কারণ অ্যাডমিনিস্ট্রেটর চলে গেছে এবং আপনাকে সেই কনফিগ বজায় রাখতে হবে, তবে এটি একটি বড় ভুল হবে। তাই স্টার্টআপ-কনফিগ রানিং-কনফিগে কপি করা ভুলবেন না। এটি পুরনো কনফিগের সমস্ত তথ্য, যেমন অজানা enable secret, রানিং-কনফিগে কপি করবে। তবে, আপনি ইতিমধ্যে enable মোডে আছেন, তাই আপনাকে সেই enable secret জানার দরকার নেই।
-    এরপর গ্লোবাল কনফিগারেশন মোডে গিয়ে একটি নতুন enable secret দিন, যা পুরনো একটিকে ওভাররাইট করবে এবং তা বর্তমান রানিং-কনফিগে চলে যাবে।
-    তারপর 'config-register 0x2102' টাইপ করুন যাতে রাউটার পরবর্তী রিস্টার্টে স্বাভাবিকভাবে বুট হয়। আবার, এটি ভুলবেন না, কারণ যদি ভুলে যান, তবে প্রতি বার বুট করার সময় এটি খালি কনফিগ সহ বুট হবে এবং আপনি ভাববেন যে রাউটারে কিছু সমস্যা রয়েছে। যদি কখনও এমন লक्षण দেখেন, যেখানে প্রতি বার বুট করার সময় মনে হয় এটি ফ্যাক্টরি রিসেট হয়ে গেছে, তবে এটি হবে কারণ কনফিগ রেজিস্টার 0x2102 তে সেট করা আছে।
-    শেষে, 'copy run start' কমান্ড দিন কনফিগারেশনটি সেভ করতে এবং আপনি এখন আবার আপনার জায়গায় ফিরে এসেছেন, তবে এবার আপনি লগ ইন আছেন এবং নতুন enable secret দিয়ে। 

এটি হলো রাউটারে পাসওয়ার্ড রিকভারি করার প্রক্রিয়া। যদি আপনি সুইচ ব্যবহার করেন, তবে এটি কিছুটা আলাদা হতে পারে, আপনার যেই মডেলটি ব্যবহার করছেন তার উপর নির্ভর করে। কিছু রাউটারও একটু ভিন্ন হতে পারে। তবে যেই ডিভাইসই হোক না কেন, এটি সেই নির্দেশনাগুলোর সাথে খুবই সাদৃশ্যপূর্ণ, যা আমি আপনাকে দেখিয়েছি, তবে কিছুটা ভিন্ন হতে পারে। আবার, গুগল করে সঠিক নির্দেশনা খুঁজে বের করে সেগুলো অনুসরণ করুন।

# Cisco সুইচের পাসওয়ার্ড রিকভারি
Cisco Catalyst 2960-X Series সুইচের পাসওয়ার্ড রিকভারি বা রিসেট প্রক্রিয়া সাধারণত নিম্নলিখিত ধাপগুলোর মাধ্যমে সম্পন্ন করা যায়:

### 1. **সুইচ রিস্টার্ট করুন**
   প্রথমে সুইচটি বন্ধ করুন (Power off)। এরপর আবার সুইচটি চালু করুন (Power on)। 

### 2. **ROMMON মোডে প্রবেশ করুন**
   সুইচ চালু হওয়ার পর, যখন লোড হচ্ছে, তখন "Mode" বাটনটি (ফ্রন্ট প্যানেলে) 10 সেকেন্ডের জন্য ধরে রাখুন। এতে আপনি "ROMMON" মোডে প্রবেশ করবেন। 

### 3. **কনফিগ রেজিস্টার পরিবর্তন করুন**
   ROMMON মোডে প্রবেশ করার পর, নিচের কমান্ডটি ব্যবহার করুন:
   ```
   confreg 0x2142
   ```
   এই কমান্ডটি সুইচকে স্টার্টআপ কনফিগ লোড না করতে বলে, যার ফলে পাসওয়ার্ড ছাড়াই সুইচটি বুট হবে।

### 4. **সুইচ রিস্টার্ট করুন**
   এরপর `reset` কমান্ড দিন:
   ```
   reset
   ```
   সুইচটি আবার রিস্টার্ট হবে এবং স্টার্টআপ কনফিগ ছাড়া নতুনভাবে বুট হবে।

### 5. **Enable মোডে প্রবেশ করুন**
   যখন সুইচটি বুট হয়ে যাবে, তখন `enable` কমান্ড ব্যবহার করে enable মোডে প্রবেশ করুন:
   ```
   enable
   ```

### 6. **স্টার্টআপ কনফিগ কপি করুন**
   স্টার্টআপ কনফিগ কপি করতে নিচের কমান্ডটি দিন:
   ```
   copy startup-config running-config
   ```
   এতে আপনি পূর্বের কনফিগ ব্যবহার করতে পারবেন, তবে পাসওয়ার্ড সুরক্ষিত থাকবে না।

### 7. **নতুন Enable পাসওয়ার্ড সেট করুন**
   এখন আপনি নতুন পাসওয়ার্ড সেট করতে পারবেন। `enable secret` কমান্ড দিয়ে নতুন পাসওয়ার্ড নির্ধারণ করুন:
   ```
   configure terminal
   enable secret [new_password]
   ```

### 8. **কনফিগ রেজিস্টার পরিবর্তন করুন**
   কনফিগ রেজিস্টারটি আবার 0x2102 এ পরিবর্তন করুন, যাতে পরবর্তী বুটে স্বাভাবিক কনফিগ লোড হয়:
   ```
   config-register 0x2102
   ```

### 9. **কনফিগ সেভ করুন**
   অবশেষে, নতুন কনফিগারেশনটি সেভ করতে `copy running-config startup-config` কমান্ড দিন:
   ```
   copy running-config startup-config
   ```

এখন আপনার সুইচ রিসেট এবং নতুন পাসওয়ার্ড সেট করা হয়ে গেছে। পরবর্তী বুটে এটি স্বাভাবিকভাবে কাজ করবে।
